GopalSaraf/Practicals/PSDL/include/proc/pic16f1777.inc
// Register: CCPR7L
#define CCPR7L CCPR7L
CCPR7L                                   equ 0299h
// bitfield definitions
CCPR7L_RL_POSN                           equ 0000h
CCPR7L_RL_POSITION                       equ 0000h
CCPR7L_RL_SIZE                           equ 0008h
CCPR7L_RL_LENGTH                         equ 0008h
CCPR7L_RL_MASK                           equ 00FFh

// Register: CCPR7H
#define CCPR7H CCPR7H
CCPR7H                                   equ 029Ah
// bitfield definitions
CCPR7H_RH_POSN                           equ 0000h
CCPR7H_RH_POSITION                       equ 0000h
CCPR7H_RH_SIZE                           equ 0008h
CCPR7H_RH_LENGTH                         equ 0008h
CCPR7H_RH_MASK                           equ 00FFh

// Register: CCP7CON
#define CCP7CON CCP7CON
CCP7CON                                  equ 029Bh
// bitfield definitions
CCP7CON_MODE_POSN                        equ 0000h
CCP7CON_MODE_POSITION                    equ 0000h
CCP7CON_MODE_SIZE                        equ 0004h
CCP7CON_MODE_LENGTH                      equ 0004h
CCP7CON_MODE_MASK                        equ 000Fh
CCP7CON_FMT_POSN                         equ 0004h
CCP7CON_FMT_POSITION                     equ 0004h
CCP7CON_FMT_SIZE                         equ 0001h
CCP7CON_FMT_LENGTH                       equ 0001h
CCP7CON_FMT_MASK                         equ 0010h
CCP7CON_OUT_POSN                         equ 0005h
CCP7CON_OUT_POSITION                     equ 0005h
CCP7CON_OUT_SIZE                         equ 0001h
CCP7CON_OUT_LENGTH                       equ 0001h
CCP7CON_OUT_MASK                         equ 0020h
CCP7CON_EN_POSN                          equ 0007h
CCP7CON_EN_POSITION                      equ 0007h
CCP7CON_EN_SIZE                          equ 0001h
CCP7CON_EN_LENGTH                        equ 0001h
CCP7CON_EN_MASK                          equ 0080h
CCP7CON_MODE0_POSN                       equ 0000h
CCP7CON_MODE0_POSITION                   equ 0000h
CCP7CON_MODE0_SIZE                       equ 0001h
CCP7CON_MODE0_LENGTH                     equ 0001h
CCP7CON_MODE0_MASK                       equ 0001h
CCP7CON_MODE1_POSN                       equ 0001h
CCP7CON_MODE1_POSITION                   equ 0001h
CCP7CON_MODE1_SIZE                       equ 0001h
CCP7CON_MODE1_LENGTH                     equ 0001h
CCP7CON_MODE1_MASK                       equ 0002h
CCP7CON_MODE2_POSN                       equ 0002h
CCP7CON_MODE2_POSITION                   equ 0002h
CCP7CON_MODE2_SIZE                       equ 0001h
CCP7CON_MODE2_LENGTH                     equ 0001h
CCP7CON_MODE2_MASK                       equ 0004h
CCP7CON_MODE3_POSN                       equ 0003h
CCP7CON_MODE3_POSITION                   equ 0003h
CCP7CON_MODE3_SIZE                       equ 0001h
CCP7CON_MODE3_LENGTH                     equ 0001h
CCP7CON_MODE3_MASK                       equ 0008h
CCP7CON_CCP7MODE_POSN                    equ 0000h
CCP7CON_CCP7MODE_POSITION                equ 0000h
CCP7CON_CCP7MODE_SIZE                    equ 0004h
CCP7CON_CCP7MODE_LENGTH                  equ 0004h
CCP7CON_CCP7MODE_MASK                    equ 000Fh
CCP7CON_CCP7FMT_POSN                     equ 0004h
CCP7CON_CCP7FMT_POSITION                 equ 0004h
CCP7CON_CCP7FMT_SIZE                     equ 0001h
CCP7CON_CCP7FMT_LENGTH                   equ 0001h
CCP7CON_CCP7FMT_MASK                     equ 0010h
CCP7CON_CCP7OUT_POSN                     equ 0005h
CCP7CON_CCP7OUT_POSITION                 equ 0005h
CCP7CON_CCP7OUT_SIZE                     equ 0001h
CCP7CON_CCP7OUT_LENGTH                   equ 0001h
CCP7CON_CCP7OUT_MASK                     equ 0020h
CCP7CON_CCP7EN_POSN                      equ 0007h
CCP7CON_CCP7EN_POSITION                  equ 0007h
CCP7CON_CCP7EN_SIZE                      equ 0001h
CCP7CON_CCP7EN_LENGTH                    equ 0001h
CCP7CON_CCP7EN_MASK                      equ 0080h
CCP7CON_CCP7MODE0_POSN                   equ 0000h
CCP7CON_CCP7MODE0_POSITION               equ 0000h
CCP7CON_CCP7MODE0_SIZE                   equ 0001h
CCP7CON_CCP7MODE0_LENGTH                 equ 0001h
CCP7CON_CCP7MODE0_MASK                   equ 0001h
CCP7CON_CCP7MODE1_POSN                   equ 0001h
CCP7CON_CCP7MODE1_POSITION               equ 0001h
CCP7CON_CCP7MODE1_SIZE                   equ 0001h
CCP7CON_CCP7MODE1_LENGTH                 equ 0001h
CCP7CON_CCP7MODE1_MASK                   equ 0002h
CCP7CON_CCP7MODE2_POSN                   equ 0002h
CCP7CON_CCP7MODE2_POSITION               equ 0002h
CCP7CON_CCP7MODE2_SIZE                   equ 0001h
CCP7CON_CCP7MODE2_LENGTH                 equ 0001h
CCP7CON_CCP7MODE2_MASK                   equ 0004h
CCP7CON_CCP7MODE3_POSN                   equ 0003h
CCP7CON_CCP7MODE3_POSITION               equ 0003h
CCP7CON_CCP7MODE3_SIZE                   equ 0001h
CCP7CON_CCP7MODE3_LENGTH                 equ 0001h
CCP7CON_CCP7MODE3_MASK                   equ 0008h

// Register: CCP7CAP
#define CCP7CAP CCP7CAP
CCP7CAP                                  equ 029Ch
// bitfield definitions
CCP7CAP_CTS_POSN                         equ 0000h
CCP7CAP_CTS_POSITION                     equ 0000h
CCP7CAP_CTS_SIZE                         equ 0008h
CCP7CAP_CTS_LENGTH                       equ 0008h
CCP7CAP_CTS_MASK                         equ 00FFh
CCP7CAP_CTS0_POSN                        equ 0000h
CCP7CAP_CTS0_POSITION                    equ 0000h
CCP7CAP_CTS0_SIZE                        equ 0001h
CCP7CAP_CTS0_LENGTH                      equ 0001h
CCP7CAP_CTS0_MASK                        equ 0001h
CCP7CAP_CTS1_POSN                        equ 0001h
CCP7CAP_CTS1_POSITION                    equ 0001h
CCP7CAP_CTS1_SIZE                        equ 0001h
CCP7CAP_CTS1_LENGTH                      equ 0001h
CCP7CAP_CTS1_MASK                        equ 0002h
CCP7CAP_CTS2_POSN                        equ 0002h
CCP7CAP_CTS2_POSITION                    equ 0002h
CCP7CAP_CTS2_SIZE                        equ 0001h
CCP7CAP_CTS2_LENGTH                      equ 0001h
CCP7CAP_CTS2_MASK                        equ 0004h
CCP7CAP_CTS3_POSN                        equ 0003h
CCP7CAP_CTS3_POSITION                    equ 0003h
CCP7CAP_CTS3_SIZE                        equ 0001h
CCP7CAP_CTS3_LENGTH                      equ 0001h
CCP7CAP_CTS3_MASK                        equ 0008h
CCP7CAP_CCP7CTS_POSN                     equ 0000h
CCP7CAP_CCP7CTS_POSITION                 equ 0000h
CCP7CAP_CCP7CTS_SIZE                     equ 0008h
CCP7CAP_CCP7CTS_LENGTH                   equ 0008h
CCP7CAP_CCP7CTS_MASK                     equ 00FFh
CCP7CAP_CCP7CTS0_POSN                    equ 0000h
CCP7CAP_CCP7CTS0_POSITION                equ 0000h
CCP7CAP_CCP7CTS0_SIZE                    equ 0001h
CCP7CAP_CCP7CTS0_LENGTH                  equ 0001h
CCP7CAP_CCP7CTS0_MASK                    equ 0001h
CCP7CAP_CCP7CTS1_POSN                    equ 0001h
CCP7CAP_CCP7CTS1_POSITION                equ 0001h
CCP7CAP_CCP7CTS1_SIZE                    equ 0001h
CCP7CAP_CCP7CTS1_LENGTH                  equ 0001h
CCP7CAP_CCP7CTS1_MASK                    equ 0002h
CCP7CAP_CCP7CTS2_POSN                    equ 0002h
CCP7CAP_CCP7CTS2_POSITION                equ 0002h
CCP7CAP_CCP7CTS2_SIZE                    equ 0001h
CCP7CAP_CCP7CTS2_LENGTH                  equ 0001h
CCP7CAP_CCP7CTS2_MASK                    equ 0004h
CCP7CAP_CCP7CTS3_POSN                    equ 0003h
CCP7CAP_CCP7CTS3_POSITION                equ 0003h
CCP7CAP_CCP7CTS3_SIZE                    equ 0001h
CCP7CAP_CCP7CTS3_LENGTH                  equ 0001h
CCP7CAP_CCP7CTS3_MASK                    equ 0008h

// Register: CCPTMRS1
#define CCPTMRS1 CCPTMRS1
CCPTMRS1                                 equ 029Eh
// bitfield definitions
CCPTMRS1_C1TSEL_POSN                     equ 0000h
CCPTMRS1_C1TSEL_POSITION                 equ 0000h
CCPTMRS1_C1TSEL_SIZE                     equ 0002h
CCPTMRS1_C1TSEL_LENGTH                   equ 0002h
CCPTMRS1_C1TSEL_MASK                     equ 0003h
CCPTMRS1_C2TSEL_POSN                     equ 0002h
CCPTMRS1_C2TSEL_POSITION                 equ 0002h
CCPTMRS1_C2TSEL_SIZE                     equ 0002h
CCPTMRS1_C2TSEL_LENGTH                   equ 0002h
CCPTMRS1_C2TSEL_MASK                     equ 000Ch
CCPTMRS1_C7TSEL_POSN                     equ 0004h
CCPTMRS1_C7TSEL_POSITION                 equ 0004h
CCPTMRS1_C7TSEL_SIZE                     equ 0002h
CCPTMRS1_C7TSEL_LENGTH                   equ 0002h
CCPTMRS1_C7TSEL_MASK                     equ 0030h
CCPTMRS1_C8TSEL_POSN                     equ 0006h
CCPTMRS1_C8TSEL_POSITION                 equ 0006h
CCPTMRS1_C8TSEL_SIZE                     equ 0002h
CCPTMRS1_C8TSEL_LENGTH                   equ 0002h
CCPTMRS1_C8TSEL_MASK                     equ 00C0h
CCPTMRS1_C1TSEL0_POSN                    equ 0000h
CCPTMRS1_C1TSEL0_POSITION                equ 0000h
CCPTMRS1_C1TSEL0_SIZE                    equ 0001h
CCPTMRS1_C1TSEL0_LENGTH                  equ 0001h
CCPTMRS1_C1TSEL0_MASK                    equ 0001h
CCPTMRS1_C1TSEL1_POSN                    equ 0001h
CCPTMRS1_C1TSEL1_POSITION                equ 0001h
CCPTMRS1_C1TSEL1_SIZE                    equ 0001h
CCPTMRS1_C1TSEL1_LENGTH                  equ 0001h
CCPTMRS1_C1TSEL1_MASK                    equ 0002h
CCPTMRS1_C2TSEL0_POSN                    equ 0002h
CCPTMRS1_C2TSEL0_POSITION                equ 0002h
CCPTMRS1_C2TSEL0_SIZE                    equ 0001h
CCPTMRS1_C2TSEL0_LENGTH                  equ 0001h
CCPTMRS1_C2TSEL0_MASK                    equ 0004h
CCPTMRS1_C2TSEL1_POSN                    equ 0003h
CCPTMRS1_C2TSEL1_POSITION                equ 0003h
CCPTMRS1_C2TSEL1_SIZE                    equ 0001h
CCPTMRS1_C2TSEL1_LENGTH                  equ 0001h
CCPTMRS1_C2TSEL1_MASK                    equ 0008h
CCPTMRS1_C7TSEL0_POSN                    equ 0004h
CCPTMRS1_C7TSEL0_POSITION                equ 0004h
CCPTMRS1_C7TSEL0_SIZE                    equ 0001h
CCPTMRS1_C7TSEL0_LENGTH                  equ 0001h
CCPTMRS1_C7TSEL0_MASK                    equ 0010h
CCPTMRS1_C7TSEL1_POSN                    equ 0005h
CCPTMRS1_C7TSEL1_POSITION                equ 0005h
CCPTMRS1_C7TSEL1_SIZE                    equ 0001h
CCPTMRS1_C7TSEL1_LENGTH                  equ 0001h
CCPTMRS1_C7TSEL1_MASK                    equ 0020h

// Register: CCPTMRS2
#define CCPTMRS2 CCPTMRS2
CCPTMRS2                                 equ 029Fh
// bitfield definitions
CCPTMRS2_P3TSEL_POSN                     equ 0000h
CCPTMRS2_P3TSEL_POSITION                 equ 0000h
CCPTMRS2_P3TSEL_SIZE                     equ 0002h
CCPTMRS2_P3TSEL_LENGTH                   equ 0002h
CCPTMRS2_P3TSEL_MASK                     equ 0003h
CCPTMRS2_P4TSEL_POSN                     equ 0002h
CCPTMRS2_P4TSEL_POSITION                 equ 0002h
CCPTMRS2_P4TSEL_SIZE                     equ 0002h
CCPTMRS2_P4TSEL_LENGTH                   equ 0002h
CCPTMRS2_P4TSEL_MASK                     equ 000Ch
CCPTMRS2_P9TSEL_POSN                     equ 0004h
CCPTMRS2_P9TSEL_POSITION                 equ 0004h
CCPTMRS2_P9TSEL_SIZE                     equ 0002h
CCPTMRS2_P9TSEL_LENGTH                   equ 0002h
CCPTMRS2_P9TSEL_MASK                     equ 0030h
CCPTMRS2_P10TSEL_POSN                    equ 0006h
CCPTMRS2_P10TSEL_POSITION                equ 0006h
CCPTMRS2_P10TSEL_SIZE                    equ 0002h
CCPTMRS2_P10TSEL_LENGTH                  equ 0002h
CCPTMRS2_P10TSEL_MASK                    equ 00C0h
CCPTMRS2_P3TSEL0_POSN                    equ 0000h
CCPTMRS2_P3TSEL0_POSITION                equ 0000h
CCPTMRS2_P3TSEL0_SIZE                    equ 0001h
CCPTMRS2_P3TSEL0_LENGTH                  equ 0001h
CCPTMRS2_P3TSEL0_MASK                    equ 0001h
CCPTMRS2_P3TSEL1_POSN                    equ 0001h
CCPTMRS2_P3TSEL1_POSITION                equ 0001h
CCPTMRS2_P3TSEL1_SIZE                    equ 0001h
CCPTMRS2_P3TSEL1_LENGTH                  equ 0001h
CCPTMRS2_P3TSEL1_MASK                    equ 0002h
CCPTMRS2_P4TSEL0_POSN                    equ 0002h
CCPTMRS2_P4TSEL0_POSITION                equ 0002h
CCPTMRS2_P4TSEL0_SIZE                    equ 0001h
CCPTMRS2_P4TSEL0_LENGTH                  equ 0001h
CCPTMRS2_P4TSEL0_MASK                    equ 0004h
CCPTMRS2_P4TSEL1_POSN                    equ 0003h
CCPTMRS2_P4TSEL1_POSITION                equ 0003h
CCPTMRS2_P4TSEL1_SIZE                    equ 0001h
CCPTMRS2_P4TSEL1_LENGTH                  equ 0001h
CCPTMRS2_P4TSEL1_MASK                    equ 0008h
CCPTMRS2_P9TSEL0_POSN                    equ 0004h
CCPTMRS2_P9TSEL0_POSITION                equ 0004h
CCPTMRS2_P9TSEL0_SIZE                    equ 0001h
CCPTMRS2_P9TSEL0_LENGTH                  equ 0001h
CCPTMRS2_P9TSEL0_MASK                    equ 0010h
CCPTMRS2_P9TSEL1_POSN                    equ 0005h
CCPTMRS2_P9TSEL1_POSITION                equ 0005h
CCPTMRS2_P9TSEL1_SIZE                    equ 0001h
CCPTMRS2_P9TSEL1_LENGTH                  equ 0001h
CCPTMRS2_P9TSEL1_MASK                    equ 0020h

// Register: SLRCONA
#define SLRCONA SLRCONA
SLRCONA                                  equ 030Ch
// bitfield definitions
SLRCONA_SLRA0_POSN                       equ 0000h
SLRCONA_SLRA0_POSITION                   equ 0000h
SLRCONA_SLRA0_SIZE                       equ 0001h
SLRCONA_SLRA0_LENGTH                     equ 0001h
SLRCONA_SLRA0_MASK                       equ 0001h
SLRCONA_SLRA1_POSN                       equ 0001h
SLRCONA_SLRA1_POSITION                   equ 0001h
SLRCONA_SLRA1_SIZE                       equ 0001h
SLRCONA_SLRA1_LENGTH                     equ 0001h
SLRCONA_SLRA1_MASK                       equ 0002h
SLRCONA_SLRA2_POSN                       equ 0002h
SLRCONA_SLRA2_POSITION                   equ 0002h
SLRCONA_SLRA2_SIZE                       equ 0001h
SLRCONA_SLRA2_LENGTH                     equ 0001h
SLRCONA_SLRA2_MASK                       equ 0004h
SLRCONA_SLRA3_POSN                       equ 0003h
SLRCONA_SLRA3_POSITION                   equ 0003h
SLRCONA_SLRA3_SIZE                       equ 0001h
SLRCONA_SLRA3_LENGTH                     equ 0001h
SLRCONA_SLRA3_MASK                       equ 0008h
SLRCONA_SLRA4_POSN                       equ 0004h
SLRCONA_SLRA4_POSITION                   equ 0004h
SLRCONA_SLRA4_SIZE                       equ 0001h
SLRCONA_SLRA4_LENGTH                     equ 0001h
SLRCONA_SLRA4_MASK                       equ 0010h
SLRCONA_SLRA5_POSN                       equ 0005h
SLRCONA_SLRA5_POSITION                   equ 0005h
SLRCONA_SLRA5_SIZE                       equ 0001h
SLRCONA_SLRA5_LENGTH                     equ 0001h
SLRCONA_SLRA5_MASK                       equ 0020h
SLRCONA_SLRA6_POSN                       equ 0006h
SLRCONA_SLRA6_POSITION                   equ 0006h
SLRCONA_SLRA6_SIZE                       equ 0001h
SLRCONA_SLRA6_LENGTH                     equ 0001h
SLRCONA_SLRA6_MASK                       equ 0040h
SLRCONA_SLRA7_POSN                       equ 0007h
SLRCONA_SLRA7_POSITION                   equ 0007h
SLRCONA_SLRA7_SIZE                       equ 0001h
SLRCONA_SLRA7_LENGTH                     equ 0001h
SLRCONA_SLRA7_MASK                       equ 0080h

// Register: SLRCONB
#define SLRCONB SLRCONB
SLRCONB                                  equ 030Dh
// bitfield definitions
SLRCONB_SLRB0_POSN                       equ 0000h
SLRCONB_SLRB0_POSITION                   equ 0000h
SLRCONB_SLRB0_SIZE                       equ 0001h
SLRCONB_SLRB0_LENGTH                     equ 0001h
SLRCONB_SLRB0_MASK                       equ 0001h
SLRCONB_SLRB1_POSN                       equ 0001h
SLRCONB_SLRB1_POSITION                   equ 0001h
SLRCONB_SLRB1_SIZE                       equ 0001h
SLRCONB_SLRB1_LENGTH                     equ 0001h
SLRCONB_SLRB1_MASK                       equ 0002h
SLRCONB_SLRB2_POSN                       equ 0002h
SLRCONB_SLRB2_POSITION                   equ 0002h
SLRCONB_SLRB2_SIZE                       equ 0001h
SLRCONB_SLRB2_LENGTH                     equ 0001h
SLRCONB_SLRB2_MASK                       equ 0004h
SLRCONB_SLRB3_POSN                       equ 0003h
SLRCONB_SLRB3_POSITION                   equ 0003h
SLRCONB_SLRB3_SIZE                       equ 0001h
SLRCONB_SLRB3_LENGTH                     equ 0001h
SLRCONB_SLRB3_MASK                       equ 0008h
SLRCONB_SLRB4_POSN                       equ 0004h
SLRCONB_SLRB4_POSITION                   equ 0004h
SLRCONB_SLRB4_SIZE                       equ 0001h
SLRCONB_SLRB4_LENGTH                     equ 0001h
SLRCONB_SLRB4_MASK                       equ 0010h
SLRCONB_SLRB5_POSN                       equ 0005h
SLRCONB_SLRB5_POSITION                   equ 0005h
SLRCONB_SLRB5_SIZE                       equ 0001h
SLRCONB_SLRB5_LENGTH                     equ 0001h
SLRCONB_SLRB5_MASK                       equ 0020h
SLRCONB_SLRB6_POSN                       equ 0006h
SLRCONB_SLRB6_POSITION                   equ 0006h
SLRCONB_SLRB6_SIZE                       equ 0001h
SLRCONB_SLRB6_LENGTH                     equ 0001h
SLRCONB_SLRB6_MASK                       equ 0040h
SLRCONB_SLRB7_POSN                       equ 0007h
SLRCONB_SLRB7_POSITION                   equ 0007h
SLRCONB_SLRB7_SIZE                       equ 0001h
SLRCONB_SLRB7_LENGTH                     equ 0001h
SLRCONB_SLRB7_MASK                       equ 0080h

// Register: SLRCONC
#define SLRCONC SLRCONC
SLRCONC                                  equ 030Eh
// bitfield definitions
SLRCONC_SLRC0_POSN                       equ 0000h
SLRCONC_SLRC0_POSITION                   equ 0000h
SLRCONC_SLRC0_SIZE                       equ 0001h
SLRCONC_SLRC0_LENGTH                     equ 0001h
SLRCONC_SLRC0_MASK                       equ 0001h
SLRCONC_SLRC1_POSN                       equ 0001h
SLRCONC_SLRC1_POSITION                   equ 0001h
SLRCONC_SLRC1_SIZE                       equ 0001h
SLRCONC_SLRC1_LENGTH                     equ 0001h
SLRCONC_SLRC1_MASK                       equ 0002h
SLRCONC_SLRC2_POSN                       equ 0002h
SLRCONC_SLRC2_POSITION                   equ 0002h
SLRCONC_SLRC2_SIZE                       equ 0001h
SLRCONC_SLRC2_LENGTH                     equ 0001h
SLRCONC_SLRC2_MASK                       equ 0004h
SLRCONC_SLRC3_POSN                       equ 0003h
SLRCONC_SLRC3_POSITION                   equ 0003h
SLRCONC_SLRC3_SIZE                       equ 0001h
SLRCONC_SLRC3_LENGTH                     equ 0001h
SLRCONC_SLRC3_MASK                       equ 0008h
SLRCONC_SLRC4_POSN                       equ 0004h
SLRCONC_SLRC4_POSITION                   equ 0004h
SLRCONC_SLRC4_SIZE                       equ 0001h
SLRCONC_SLRC4_LENGTH                     equ 0001h
SLRCONC_SLRC4_MASK                       equ 0010h
SLRCONC_SLRC5_POSN                       equ 0005h
SLRCONC_SLRC5_POSITION                   equ 0005h
SLRCONC_SLRC5_SIZE                       equ 0001h
SLRCONC_SLRC5_LENGTH                     equ 0001h
SLRCONC_SLRC5_MASK                       equ 0020h
SLRCONC_SLRC6_POSN                       equ 0006h
SLRCONC_SLRC6_POSITION                   equ 0006h
SLRCONC_SLRC6_SIZE                       equ 0001h
SLRCONC_SLRC6_LENGTH                     equ 0001h
SLRCONC_SLRC6_MASK                       equ 0040h
SLRCONC_SLRC7_POSN                       equ 0007h
SLRCONC_SLRC7_POSITION                   equ 0007h
SLRCONC_SLRC7_SIZE                       equ 0001h
SLRCONC_SLRC7_LENGTH                     equ 0001h
SLRCONC_SLRC7_MASK                       equ 0080h

