GopalSaraf/Practicals/PSDL/include/proc/pic16f1777.inc
// Register: OPA1CON
#define OPA1CON OPA1CON
OPA1CON                                  equ 0511h
// bitfield definitions
OPA1CON_ORM_POSN                         equ 0000h
OPA1CON_ORM_POSITION                     equ 0000h
OPA1CON_ORM_SIZE                         equ 0002h
OPA1CON_ORM_LENGTH                       equ 0002h
OPA1CON_ORM_MASK                         equ 0003h
OPA1CON_ORPOL_POSN                       equ 0002h
OPA1CON_ORPOL_POSITION                   equ 0002h
OPA1CON_ORPOL_SIZE                       equ 0001h
OPA1CON_ORPOL_LENGTH                     equ 0001h
OPA1CON_ORPOL_MASK                       equ 0004h
OPA1CON_UG_POSN                          equ 0004h
OPA1CON_UG_POSITION                      equ 0004h
OPA1CON_UG_SIZE                          equ 0001h
OPA1CON_UG_LENGTH                        equ 0001h
OPA1CON_UG_MASK                          equ 0010h
OPA1CON_EN_POSN                          equ 0007h
OPA1CON_EN_POSITION                      equ 0007h
OPA1CON_EN_SIZE                          equ 0001h
OPA1CON_EN_LENGTH                        equ 0001h
OPA1CON_EN_MASK                          equ 0080h
OPA1CON_ORM0_POSN                        equ 0000h
OPA1CON_ORM0_POSITION                    equ 0000h
OPA1CON_ORM0_SIZE                        equ 0001h
OPA1CON_ORM0_LENGTH                      equ 0001h
OPA1CON_ORM0_MASK                        equ 0001h
OPA1CON_ORM1_POSN                        equ 0001h
OPA1CON_ORM1_POSITION                    equ 0001h
OPA1CON_ORM1_SIZE                        equ 0001h
OPA1CON_ORM1_LENGTH                      equ 0001h
OPA1CON_ORM1_MASK                        equ 0002h
OPA1CON_OPA1ORM_POSN                     equ 0000h
OPA1CON_OPA1ORM_POSITION                 equ 0000h
OPA1CON_OPA1ORM_SIZE                     equ 0002h
OPA1CON_OPA1ORM_LENGTH                   equ 0002h
OPA1CON_OPA1ORM_MASK                     equ 0003h
OPA1CON_OPA1ORPOL_POSN                   equ 0002h
OPA1CON_OPA1ORPOL_POSITION               equ 0002h
OPA1CON_OPA1ORPOL_SIZE                   equ 0001h
OPA1CON_OPA1ORPOL_LENGTH                 equ 0001h
OPA1CON_OPA1ORPOL_MASK                   equ 0004h
OPA1CON_OPA1UG_POSN                      equ 0004h
OPA1CON_OPA1UG_POSITION                  equ 0004h
OPA1CON_OPA1UG_SIZE                      equ 0001h
OPA1CON_OPA1UG_LENGTH                    equ 0001h
OPA1CON_OPA1UG_MASK                      equ 0010h
OPA1CON_OPA1EN_POSN                      equ 0007h
OPA1CON_OPA1EN_POSITION                  equ 0007h
OPA1CON_OPA1EN_SIZE                      equ 0001h
OPA1CON_OPA1EN_LENGTH                    equ 0001h
OPA1CON_OPA1EN_MASK                      equ 0080h
OPA1CON_OPA1ORM0_POSN                    equ 0000h
OPA1CON_OPA1ORM0_POSITION                equ 0000h
OPA1CON_OPA1ORM0_SIZE                    equ 0001h
OPA1CON_OPA1ORM0_LENGTH                  equ 0001h
OPA1CON_OPA1ORM0_MASK                    equ 0001h
OPA1CON_OPA1ORM1_POSN                    equ 0001h
OPA1CON_OPA1ORM1_POSITION                equ 0001h
OPA1CON_OPA1ORM1_SIZE                    equ 0001h
OPA1CON_OPA1ORM1_LENGTH                  equ 0001h
OPA1CON_OPA1ORM1_MASK                    equ 0002h

// Register: OPA1ORS
#define OPA1ORS OPA1ORS
OPA1ORS                                  equ 0512h
// bitfield definitions
OPA1ORS_ORS_POSN                         equ 0000h
OPA1ORS_ORS_POSITION                     equ 0000h
OPA1ORS_ORS_SIZE                         equ 0008h
OPA1ORS_ORS_LENGTH                       equ 0008h
OPA1ORS_ORS_MASK                         equ 00FFh

// Register: OPA2NCHS
#define OPA2NCHS OPA2NCHS
OPA2NCHS                                 equ 0513h
// bitfield definitions
OPA2NCHS_NCH_POSN                        equ 0000h
OPA2NCHS_NCH_POSITION                    equ 0000h
OPA2NCHS_NCH_SIZE                        equ 0008h
OPA2NCHS_NCH_LENGTH                      equ 0008h
OPA2NCHS_NCH_MASK                        equ 00FFh
OPA2NCHS_OPA2NCH_POSN                    equ 0000h
OPA2NCHS_OPA2NCH_POSITION                equ 0000h
OPA2NCHS_OPA2NCH_SIZE                    equ 0008h
OPA2NCHS_OPA2NCH_LENGTH                  equ 0008h
OPA2NCHS_OPA2NCH_MASK                    equ 00FFh

// Register: OPA2PCHS
#define OPA2PCHS OPA2PCHS
OPA2PCHS                                 equ 0514h
// bitfield definitions
OPA2PCHS_PCH_POSN                        equ 0000h
OPA2PCHS_PCH_POSITION                    equ 0000h
OPA2PCHS_PCH_SIZE                        equ 0008h
OPA2PCHS_PCH_LENGTH                      equ 0008h
OPA2PCHS_PCH_MASK                        equ 00FFh
OPA2PCHS_OPA2PCH_POSN                    equ 0000h
OPA2PCHS_OPA2PCH_POSITION                equ 0000h
OPA2PCHS_OPA2PCH_SIZE                    equ 0008h
OPA2PCHS_OPA2PCH_LENGTH                  equ 0008h
OPA2PCHS_OPA2PCH_MASK                    equ 00FFh

// Register: OPA2CON
#define OPA2CON OPA2CON
OPA2CON                                  equ 0515h
// bitfield definitions
OPA2CON_ORM_POSN                         equ 0000h
OPA2CON_ORM_POSITION                     equ 0000h
OPA2CON_ORM_SIZE                         equ 0002h
OPA2CON_ORM_LENGTH                       equ 0002h
OPA2CON_ORM_MASK                         equ 0003h
OPA2CON_ORPOL_POSN                       equ 0002h
OPA2CON_ORPOL_POSITION                   equ 0002h
OPA2CON_ORPOL_SIZE                       equ 0001h
OPA2CON_ORPOL_LENGTH                     equ 0001h
OPA2CON_ORPOL_MASK                       equ 0004h
OPA2CON_UG_POSN                          equ 0004h
OPA2CON_UG_POSITION                      equ 0004h
OPA2CON_UG_SIZE                          equ 0001h
OPA2CON_UG_LENGTH                        equ 0001h
OPA2CON_UG_MASK                          equ 0010h
OPA2CON_EN_POSN                          equ 0007h
OPA2CON_EN_POSITION                      equ 0007h
OPA2CON_EN_SIZE                          equ 0001h
OPA2CON_EN_LENGTH                        equ 0001h
OPA2CON_EN_MASK                          equ 0080h
OPA2CON_ORM0_POSN                        equ 0000h
OPA2CON_ORM0_POSITION                    equ 0000h
OPA2CON_ORM0_SIZE                        equ 0001h
OPA2CON_ORM0_LENGTH                      equ 0001h
OPA2CON_ORM0_MASK                        equ 0001h
OPA2CON_ORM1_POSN                        equ 0001h
OPA2CON_ORM1_POSITION                    equ 0001h
OPA2CON_ORM1_SIZE                        equ 0001h
OPA2CON_ORM1_LENGTH                      equ 0001h
OPA2CON_ORM1_MASK                        equ 0002h
OPA2CON_OPA2ORM_POSN                     equ 0000h
OPA2CON_OPA2ORM_POSITION                 equ 0000h
OPA2CON_OPA2ORM_SIZE                     equ 0002h
OPA2CON_OPA2ORM_LENGTH                   equ 0002h
OPA2CON_OPA2ORM_MASK                     equ 0003h
OPA2CON_OPA2ORPOL_POSN                   equ 0002h
OPA2CON_OPA2ORPOL_POSITION               equ 0002h
OPA2CON_OPA2ORPOL_SIZE                   equ 0001h
OPA2CON_OPA2ORPOL_LENGTH                 equ 0001h
OPA2CON_OPA2ORPOL_MASK                   equ 0004h
OPA2CON_OPA2UG_POSN                      equ 0004h
OPA2CON_OPA2UG_POSITION                  equ 0004h
OPA2CON_OPA2UG_SIZE                      equ 0001h
OPA2CON_OPA2UG_LENGTH                    equ 0001h
OPA2CON_OPA2UG_MASK                      equ 0010h
OPA2CON_OPA2EN_POSN                      equ 0007h
OPA2CON_OPA2EN_POSITION                  equ 0007h
OPA2CON_OPA2EN_SIZE                      equ 0001h
OPA2CON_OPA2EN_LENGTH                    equ 0001h
OPA2CON_OPA2EN_MASK                      equ 0080h
OPA2CON_OPA2ORM0_POSN                    equ 0000h
OPA2CON_OPA2ORM0_POSITION                equ 0000h
OPA2CON_OPA2ORM0_SIZE                    equ 0001h
OPA2CON_OPA2ORM0_LENGTH                  equ 0001h
OPA2CON_OPA2ORM0_MASK                    equ 0001h
OPA2CON_OPA2ORM1_POSN                    equ 0001h
OPA2CON_OPA2ORM1_POSITION                equ 0001h
OPA2CON_OPA2ORM1_SIZE                    equ 0001h
OPA2CON_OPA2ORM1_LENGTH                  equ 0001h
OPA2CON_OPA2ORM1_MASK                    equ 0002h

// Register: OPA2ORS
#define OPA2ORS OPA2ORS
OPA2ORS                                  equ 0516h
// bitfield definitions
OPA2ORS_ORS_POSN                         equ 0000h
OPA2ORS_ORS_POSITION                     equ 0000h
OPA2ORS_ORS_SIZE                         equ 0008h
OPA2ORS_ORS_LENGTH                       equ 0008h
OPA2ORS_ORS_MASK                         equ 00FFh

// Register: OPA3NCHS
#define OPA3NCHS OPA3NCHS
OPA3NCHS                                 equ 0517h
// bitfield definitions
OPA3NCHS_NCH_POSN                        equ 0000h
OPA3NCHS_NCH_POSITION                    equ 0000h
OPA3NCHS_NCH_SIZE                        equ 0008h
OPA3NCHS_NCH_LENGTH                      equ 0008h
OPA3NCHS_NCH_MASK                        equ 00FFh
OPA3NCHS_OPA3NCH_POSN                    equ 0000h
OPA3NCHS_OPA3NCH_POSITION                equ 0000h
OPA3NCHS_OPA3NCH_SIZE                    equ 0008h
OPA3NCHS_OPA3NCH_LENGTH                  equ 0008h
OPA3NCHS_OPA3NCH_MASK                    equ 00FFh

// Register: OPA3PCHS
#define OPA3PCHS OPA3PCHS
OPA3PCHS                                 equ 0518h
// bitfield definitions
OPA3PCHS_PCH_POSN                        equ 0000h
OPA3PCHS_PCH_POSITION                    equ 0000h
OPA3PCHS_PCH_SIZE                        equ 0008h
OPA3PCHS_PCH_LENGTH                      equ 0008h
OPA3PCHS_PCH_MASK                        equ 00FFh
OPA3PCHS_OPA3PCH_POSN                    equ 0000h
OPA3PCHS_OPA3PCH_POSITION                equ 0000h
OPA3PCHS_OPA3PCH_SIZE                    equ 0008h
OPA3PCHS_OPA3PCH_LENGTH                  equ 0008h
OPA3PCHS_OPA3PCH_MASK                    equ 00FFh

// Register: OPA3CON
#define OPA3CON OPA3CON
OPA3CON                                  equ 0519h
// bitfield definitions
OPA3CON_ORM_POSN                         equ 0000h
OPA3CON_ORM_POSITION                     equ 0000h
OPA3CON_ORM_SIZE                         equ 0002h
OPA3CON_ORM_LENGTH                       equ 0002h
OPA3CON_ORM_MASK                         equ 0003h
OPA3CON_ORPOL_POSN                       equ 0002h
OPA3CON_ORPOL_POSITION                   equ 0002h
OPA3CON_ORPOL_SIZE                       equ 0001h
OPA3CON_ORPOL_LENGTH                     equ 0001h
OPA3CON_ORPOL_MASK                       equ 0004h
OPA3CON_UG_POSN                          equ 0004h
OPA3CON_UG_POSITION                      equ 0004h
OPA3CON_UG_SIZE                          equ 0001h
OPA3CON_UG_LENGTH                        equ 0001h
OPA3CON_UG_MASK                          equ 0010h
OPA3CON_SP_POSN                          equ 0006h
OPA3CON_SP_POSITION                      equ 0006h
OPA3CON_SP_SIZE                          equ 0001h
OPA3CON_SP_LENGTH                        equ 0001h
OPA3CON_SP_MASK                          equ 0040h
OPA3CON_EN_POSN                          equ 0007h
OPA3CON_EN_POSITION                      equ 0007h
OPA3CON_EN_SIZE                          equ 0001h
OPA3CON_EN_LENGTH                        equ 0001h
OPA3CON_EN_MASK                          equ 0080h
OPA3CON_ORM0_POSN                        equ 0000h
OPA3CON_ORM0_POSITION                    equ 0000h
OPA3CON_ORM0_SIZE                        equ 0001h
OPA3CON_ORM0_LENGTH                      equ 0001h
OPA3CON_ORM0_MASK                        equ 0001h
OPA3CON_ORM1_POSN                        equ 0001h
OPA3CON_ORM1_POSITION                    equ 0001h
OPA3CON_ORM1_SIZE                        equ 0001h
OPA3CON_ORM1_LENGTH                      equ 0001h
OPA3CON_ORM1_MASK                        equ 0002h
OPA3CON_OPA3ORM_POSN                     equ 0000h
OPA3CON_OPA3ORM_POSITION                 equ 0000h
OPA3CON_OPA3ORM_SIZE                     equ 0002h
OPA3CON_OPA3ORM_LENGTH                   equ 0002h
OPA3CON_OPA3ORM_MASK                     equ 0003h
OPA3CON_OPA3ORPOL_POSN                   equ 0002h
OPA3CON_OPA3ORPOL_POSITION               equ 0002h
OPA3CON_OPA3ORPOL_SIZE                   equ 0001h
OPA3CON_OPA3ORPOL_LENGTH                 equ 0001h
OPA3CON_OPA3ORPOL_MASK                   equ 0004h
OPA3CON_OPA3UG_POSN                      equ 0004h
OPA3CON_OPA3UG_POSITION                  equ 0004h
OPA3CON_OPA3UG_SIZE                      equ 0001h
OPA3CON_OPA3UG_LENGTH                    equ 0001h
OPA3CON_OPA3UG_MASK                      equ 0010h
OPA3CON_OPA3SP_POSN                      equ 0006h
OPA3CON_OPA3SP_POSITION                  equ 0006h
OPA3CON_OPA3SP_SIZE                      equ 0001h
OPA3CON_OPA3SP_LENGTH                    equ 0001h
OPA3CON_OPA3SP_MASK                      equ 0040h
OPA3CON_OPA3EN_POSN                      equ 0007h
OPA3CON_OPA3EN_POSITION                  equ 0007h
OPA3CON_OPA3EN_SIZE                      equ 0001h
OPA3CON_OPA3EN_LENGTH                    equ 0001h
OPA3CON_OPA3EN_MASK                      equ 0080h
OPA3CON_OPA3ORM0_POSN                    equ 0000h
OPA3CON_OPA3ORM0_POSITION                equ 0000h
OPA3CON_OPA3ORM0_SIZE                    equ 0001h
OPA3CON_OPA3ORM0_LENGTH                  equ 0001h
OPA3CON_OPA3ORM0_MASK                    equ 0001h
OPA3CON_OPA3ORM1_POSN                    equ 0001h
OPA3CON_OPA3ORM1_POSITION                equ 0001h
OPA3CON_OPA3ORM1_SIZE                    equ 0001h
OPA3CON_OPA3ORM1_LENGTH                  equ 0001h
OPA3CON_OPA3ORM1_MASK                    equ 0002h

// Register: OPA3ORS
#define OPA3ORS OPA3ORS
OPA3ORS                                  equ 051Ah
// bitfield definitions
OPA3ORS_ORS_POSN                         equ 0000h
OPA3ORS_ORS_POSITION                     equ 0000h
OPA3ORS_ORS_SIZE                         equ 0008h
OPA3ORS_ORS_LENGTH                       equ 0008h
OPA3ORS_ORS_MASK                         equ 00FFh

// Register: OPA4NCHS
#define OPA4NCHS OPA4NCHS
OPA4NCHS                                 equ 051Bh
// bitfield definitions
OPA4NCHS_NCH_POSN                        equ 0000h
OPA4NCHS_NCH_POSITION                    equ 0000h
OPA4NCHS_NCH_SIZE                        equ 0008h
OPA4NCHS_NCH_LENGTH                      equ 0008h
OPA4NCHS_NCH_MASK                        equ 00FFh
OPA4NCHS_OPA4NCH_POSN                    equ 0000h
OPA4NCHS_OPA4NCH_POSITION                equ 0000h
OPA4NCHS_OPA4NCH_SIZE                    equ 0008h
OPA4NCHS_OPA4NCH_LENGTH                  equ 0008h
OPA4NCHS_OPA4NCH_MASK                    equ 00FFh

// Register: OPA4PCHS
#define OPA4PCHS OPA4PCHS
OPA4PCHS                                 equ 051Ch
// bitfield definitions
OPA4PCHS_PCH_POSN                        equ 0000h
OPA4PCHS_PCH_POSITION                    equ 0000h
OPA4PCHS_PCH_SIZE                        equ 0008h
OPA4PCHS_PCH_LENGTH                      equ 0008h
OPA4PCHS_PCH_MASK                        equ 00FFh
OPA4PCHS_OPA4PCH_POSN                    equ 0000h
OPA4PCHS_OPA4PCH_POSITION                equ 0000h
OPA4PCHS_OPA4PCH_SIZE                    equ 0008h
OPA4PCHS_OPA4PCH_LENGTH                  equ 0008h
OPA4PCHS_OPA4PCH_MASK                    equ 00FFh

// Register: OPA4CON
#define OPA4CON OPA4CON
OPA4CON                                  equ 051Dh
// bitfield definitions
OPA4CON_ORM_POSN                         equ 0000h
OPA4CON_ORM_POSITION                     equ 0000h
OPA4CON_ORM_SIZE                         equ 0002h
OPA4CON_ORM_LENGTH                       equ 0002h
OPA4CON_ORM_MASK                         equ 0003h
OPA4CON_ORPOL_POSN                       equ 0002h
OPA4CON_ORPOL_POSITION                   equ 0002h
OPA4CON_ORPOL_SIZE                       equ 0001h
OPA4CON_ORPOL_LENGTH                     equ 0001h
OPA4CON_ORPOL_MASK                       equ 0004h
OPA4CON_UG_POSN                          equ 0004h
OPA4CON_UG_POSITION                      equ 0004h
OPA4CON_UG_SIZE                          equ 0001h
OPA4CON_UG_LENGTH                        equ 0001h
OPA4CON_UG_MASK                          equ 0010h
OPA4CON_SP_POSN                          equ 0006h
OPA4CON_SP_POSITION                      equ 0006h
OPA4CON_SP_SIZE                          equ 0001h
OPA4CON_SP_LENGTH                        equ 0001h
OPA4CON_SP_MASK                          equ 0040h
OPA4CON_EN_POSN                          equ 0007h
OPA4CON_EN_POSITION                      equ 0007h
OPA4CON_EN_SIZE                          equ 0001h
OPA4CON_EN_LENGTH                        equ 0001h
OPA4CON_EN_MASK                          equ 0080h
OPA4CON_ORM0_POSN                        equ 0000h
OPA4CON_ORM0_POSITION                    equ 0000h
OPA4CON_ORM0_SIZE                        equ 0001h
OPA4CON_ORM0_LENGTH                      equ 0001h
OPA4CON_ORM0_MASK                        equ 0001h
OPA4CON_ORM1_POSN                        equ 0001h
OPA4CON_ORM1_POSITION                    equ 0001h
OPA4CON_ORM1_SIZE                        equ 0001h
OPA4CON_ORM1_LENGTH                      equ 0001h
OPA4CON_ORM1_MASK                        equ 0002h
OPA4CON_OPA4ORM_POSN                     equ 0000h
OPA4CON_OPA4ORM_POSITION                 equ 0000h
OPA4CON_OPA4ORM_SIZE                     equ 0002h
OPA4CON_OPA4ORM_LENGTH                   equ 0002h
OPA4CON_OPA4ORM_MASK                     equ 0003h
OPA4CON_OPA4ORPOL_POSN                   equ 0002h
OPA4CON_OPA4ORPOL_POSITION               equ 0002h
OPA4CON_OPA4ORPOL_SIZE                   equ 0001h
OPA4CON_OPA4ORPOL_LENGTH                 equ 0001h
OPA4CON_OPA4ORPOL_MASK                   equ 0004h
OPA4CON_OPA4UG_POSN                      equ 0004h
OPA4CON_OPA4UG_POSITION                  equ 0004h
OPA4CON_OPA4UG_SIZE                      equ 0001h
OPA4CON_OPA4UG_LENGTH                    equ 0001h
OPA4CON_OPA4UG_MASK                      equ 0010h
OPA4CON_OPA4SP_POSN                      equ 0006h
OPA4CON_OPA4SP_POSITION                  equ 0006h
OPA4CON_OPA4SP_SIZE                      equ 0001h
OPA4CON_OPA4SP_LENGTH                    equ 0001h
OPA4CON_OPA4SP_MASK                      equ 0040h
OPA4CON_OPA4EN_POSN                      equ 0007h
OPA4CON_OPA4EN_POSITION                  equ 0007h
OPA4CON_OPA4EN_SIZE                      equ 0001h
OPA4CON_OPA4EN_LENGTH                    equ 0001h
OPA4CON_OPA4EN_MASK                      equ 0080h
OPA4CON_OPA4ORM0_POSN                    equ 0000h
OPA4CON_OPA4ORM0_POSITION                equ 0000h
OPA4CON_OPA4ORM0_SIZE                    equ 0001h
OPA4CON_OPA4ORM0_LENGTH                  equ 0001h
OPA4CON_OPA4ORM0_MASK                    equ 0001h
OPA4CON_OPA4ORM1_POSN                    equ 0001h
OPA4CON_OPA4ORM1_POSITION                equ 0001h
OPA4CON_OPA4ORM1_SIZE                    equ 0001h
OPA4CON_OPA4ORM1_LENGTH                  equ 0001h
OPA4CON_OPA4ORM1_MASK                    equ 0002h

// Register: OPA4ORS
#define OPA4ORS OPA4ORS
OPA4ORS                                  equ 051Eh
// bitfield definitions
OPA4ORS_ORS_POSN                         equ 0000h
OPA4ORS_ORS_POSITION                     equ 0000h
OPA4ORS_ORS_SIZE                         equ 0008h
OPA4ORS_ORS_LENGTH                       equ 0008h
OPA4ORS_ORS_MASK                         equ 00FFh

// Register: DACLD
#define DACLD DACLD
DACLD                                    equ 058Dh
// bitfield definitions
DACLD_DAC1LD_POSN                        equ 0000h
DACLD_DAC1LD_POSITION                    equ 0000h
DACLD_DAC1LD_SIZE                        equ 0001h
DACLD_DAC1LD_LENGTH                      equ 0001h
DACLD_DAC1LD_MASK                        equ 0001h
DACLD_DAC2LD_POSN                        equ 0001h
DACLD_DAC2LD_POSITION                    equ 0001h
DACLD_DAC2LD_SIZE                        equ 0001h
DACLD_DAC2LD_LENGTH                      equ 0001h
DACLD_DAC2LD_MASK                        equ 0002h
DACLD_DAC5LD_POSN                        equ 0004h
DACLD_DAC5LD_POSITION                    equ 0004h
DACLD_DAC5LD_SIZE                        equ 0001h
DACLD_DAC5LD_LENGTH                      equ 0001h
DACLD_DAC5LD_MASK                        equ 0010h
DACLD_DAC6LD_POSN                        equ 0005h
DACLD_DAC6LD_POSITION                    equ 0005h
DACLD_DAC6LD_SIZE                        equ 0001h
DACLD_DAC6LD_LENGTH                      equ 0001h
DACLD_DAC6LD_MASK                        equ 0020h

