GopalSaraf/Practicals/PSDL/include/proc/pic16f1777.inc
// Register: PRG4FTSS
#define PRG4FTSS PRG4FTSS
PRG4FTSS                                 equ 060Fh
// bitfield definitions
PRG4FTSS_FTSS_POSN                       equ 0000h
PRG4FTSS_FTSS_POSITION                   equ 0000h
PRG4FTSS_FTSS_SIZE                       equ 0008h
PRG4FTSS_FTSS_LENGTH                     equ 0008h
PRG4FTSS_FTSS_MASK                       equ 00FFh
PRG4FTSS_FTSS0_POSN                      equ 0000h
PRG4FTSS_FTSS0_POSITION                  equ 0000h
PRG4FTSS_FTSS0_SIZE                      equ 0001h
PRG4FTSS_FTSS0_LENGTH                    equ 0001h
PRG4FTSS_FTSS0_MASK                      equ 0001h
PRG4FTSS_FTSS1_POSN                      equ 0001h
PRG4FTSS_FTSS1_POSITION                  equ 0001h
PRG4FTSS_FTSS1_SIZE                      equ 0001h
PRG4FTSS_FTSS1_LENGTH                    equ 0001h
PRG4FTSS_FTSS1_MASK                      equ 0002h
PRG4FTSS_FTSS2_POSN                      equ 0002h
PRG4FTSS_FTSS2_POSITION                  equ 0002h
PRG4FTSS_FTSS2_SIZE                      equ 0001h
PRG4FTSS_FTSS2_LENGTH                    equ 0001h
PRG4FTSS_FTSS2_MASK                      equ 0004h
PRG4FTSS_FTSS3_POSN                      equ 0003h
PRG4FTSS_FTSS3_POSITION                  equ 0003h
PRG4FTSS_FTSS3_SIZE                      equ 0001h
PRG4FTSS_FTSS3_LENGTH                    equ 0001h
PRG4FTSS_FTSS3_MASK                      equ 0008h
PRG4FTSS_RG4FTSS0_POSN                   equ 0000h
PRG4FTSS_RG4FTSS0_POSITION               equ 0000h
PRG4FTSS_RG4FTSS0_SIZE                   equ 0001h
PRG4FTSS_RG4FTSS0_LENGTH                 equ 0001h
PRG4FTSS_RG4FTSS0_MASK                   equ 0001h
PRG4FTSS_RG4FTSS1_POSN                   equ 0001h
PRG4FTSS_RG4FTSS1_POSITION               equ 0001h
PRG4FTSS_RG4FTSS1_SIZE                   equ 0001h
PRG4FTSS_RG4FTSS1_LENGTH                 equ 0001h
PRG4FTSS_RG4FTSS1_MASK                   equ 0002h
PRG4FTSS_RG4FTSS2_POSN                   equ 0002h
PRG4FTSS_RG4FTSS2_POSITION               equ 0002h
PRG4FTSS_RG4FTSS2_SIZE                   equ 0001h
PRG4FTSS_RG4FTSS2_LENGTH                 equ 0001h
PRG4FTSS_RG4FTSS2_MASK                   equ 0004h
PRG4FTSS_RG4FTSS3_POSN                   equ 0003h
PRG4FTSS_RG4FTSS3_POSITION               equ 0003h
PRG4FTSS_RG4FTSS3_SIZE                   equ 0001h
PRG4FTSS_RG4FTSS3_LENGTH                 equ 0001h
PRG4FTSS_RG4FTSS3_MASK                   equ 0008h

// Register: PRG4INS
#define PRG4INS PRG4INS
PRG4INS                                  equ 0610h
// bitfield definitions
PRG4INS_INS_POSN                         equ 0000h
PRG4INS_INS_POSITION                     equ 0000h
PRG4INS_INS_SIZE                         equ 0008h
PRG4INS_INS_LENGTH                       equ 0008h
PRG4INS_INS_MASK                         equ 00FFh
PRG4INS_INS0_POSN                        equ 0000h
PRG4INS_INS0_POSITION                    equ 0000h
PRG4INS_INS0_SIZE                        equ 0001h
PRG4INS_INS0_LENGTH                      equ 0001h
PRG4INS_INS0_MASK                        equ 0001h
PRG4INS_INS1_POSN                        equ 0001h
PRG4INS_INS1_POSITION                    equ 0001h
PRG4INS_INS1_SIZE                        equ 0001h
PRG4INS_INS1_LENGTH                      equ 0001h
PRG4INS_INS1_MASK                        equ 0002h
PRG4INS_INS2_POSN                        equ 0002h
PRG4INS_INS2_POSITION                    equ 0002h
PRG4INS_INS2_SIZE                        equ 0001h
PRG4INS_INS2_LENGTH                      equ 0001h
PRG4INS_INS2_MASK                        equ 0004h
PRG4INS_INS3_POSN                        equ 0003h
PRG4INS_INS3_POSITION                    equ 0003h
PRG4INS_INS3_SIZE                        equ 0001h
PRG4INS_INS3_LENGTH                      equ 0001h
PRG4INS_INS3_MASK                        equ 0008h
PRG4INS_RG4INS0_POSN                     equ 0000h
PRG4INS_RG4INS0_POSITION                 equ 0000h
PRG4INS_RG4INS0_SIZE                     equ 0001h
PRG4INS_RG4INS0_LENGTH                   equ 0001h
PRG4INS_RG4INS0_MASK                     equ 0001h
PRG4INS_RG4INS1_POSN                     equ 0001h
PRG4INS_RG4INS1_POSITION                 equ 0001h
PRG4INS_RG4INS1_SIZE                     equ 0001h
PRG4INS_RG4INS1_LENGTH                   equ 0001h
PRG4INS_RG4INS1_MASK                     equ 0002h
PRG4INS_RG4INS2_POSN                     equ 0002h
PRG4INS_RG4INS2_POSITION                 equ 0002h
PRG4INS_RG4INS2_SIZE                     equ 0001h
PRG4INS_RG4INS2_LENGTH                   equ 0001h
PRG4INS_RG4INS2_MASK                     equ 0004h
PRG4INS_RG4INS3_POSN                     equ 0003h
PRG4INS_RG4INS3_POSITION                 equ 0003h
PRG4INS_RG4INS3_SIZE                     equ 0001h
PRG4INS_RG4INS3_LENGTH                   equ 0001h
PRG4INS_RG4INS3_MASK                     equ 0008h

// Register: PRG4CON0
#define PRG4CON0 PRG4CON0
PRG4CON0                                 equ 0611h
// bitfield definitions
PRG4CON0_GO_POSN                         equ 0000h
PRG4CON0_GO_POSITION                     equ 0000h
PRG4CON0_GO_SIZE                         equ 0001h
PRG4CON0_GO_LENGTH                       equ 0001h
PRG4CON0_GO_MASK                         equ 0001h
PRG4CON0_OS_POSN                         equ 0001h
PRG4CON0_OS_POSITION                     equ 0001h
PRG4CON0_OS_SIZE                         equ 0001h
PRG4CON0_OS_LENGTH                       equ 0001h
PRG4CON0_OS_MASK                         equ 0002h
PRG4CON0_MODE_POSN                       equ 0002h
PRG4CON0_MODE_POSITION                   equ 0002h
PRG4CON0_MODE_SIZE                       equ 0002h
PRG4CON0_MODE_LENGTH                     equ 0002h
PRG4CON0_MODE_MASK                       equ 000Ch
PRG4CON0_REDG_POSN                       equ 0004h
PRG4CON0_REDG_POSITION                   equ 0004h
PRG4CON0_REDG_SIZE                       equ 0001h
PRG4CON0_REDG_LENGTH                     equ 0001h
PRG4CON0_REDG_MASK                       equ 0010h
PRG4CON0_FEDG_POSN                       equ 0005h
PRG4CON0_FEDG_POSITION                   equ 0005h
PRG4CON0_FEDG_SIZE                       equ 0001h
PRG4CON0_FEDG_LENGTH                     equ 0001h
PRG4CON0_FEDG_MASK                       equ 0020h
PRG4CON0_EN_POSN                         equ 0007h
PRG4CON0_EN_POSITION                     equ 0007h
PRG4CON0_EN_SIZE                         equ 0001h
PRG4CON0_EN_LENGTH                       equ 0001h
PRG4CON0_EN_MASK                         equ 0080h
PRG4CON0_MODE0_POSN                      equ 0002h
PRG4CON0_MODE0_POSITION                  equ 0002h
PRG4CON0_MODE0_SIZE                      equ 0001h
PRG4CON0_MODE0_LENGTH                    equ 0001h
PRG4CON0_MODE0_MASK                      equ 0004h
PRG4CON0_MODE1_POSN                      equ 0003h
PRG4CON0_MODE1_POSITION                  equ 0003h
PRG4CON0_MODE1_SIZE                      equ 0001h
PRG4CON0_MODE1_LENGTH                    equ 0001h
PRG4CON0_MODE1_MASK                      equ 0008h
PRG4CON0_RG4GO_POSN                      equ 0000h
PRG4CON0_RG4GO_POSITION                  equ 0000h
PRG4CON0_RG4GO_SIZE                      equ 0001h
PRG4CON0_RG4GO_LENGTH                    equ 0001h
PRG4CON0_RG4GO_MASK                      equ 0001h
PRG4CON0_RG4OS_POSN                      equ 0001h
PRG4CON0_RG4OS_POSITION                  equ 0001h
PRG4CON0_RG4OS_SIZE                      equ 0001h
PRG4CON0_RG4OS_LENGTH                    equ 0001h
PRG4CON0_RG4OS_MASK                      equ 0002h
PRG4CON0_RG4MODE_POSN                    equ 0002h
PRG4CON0_RG4MODE_POSITION                equ 0002h
PRG4CON0_RG4MODE_SIZE                    equ 0002h
PRG4CON0_RG4MODE_LENGTH                  equ 0002h
PRG4CON0_RG4MODE_MASK                    equ 000Ch
PRG4CON0_RG4REDG_POSN                    equ 0004h
PRG4CON0_RG4REDG_POSITION                equ 0004h
PRG4CON0_RG4REDG_SIZE                    equ 0001h
PRG4CON0_RG4REDG_LENGTH                  equ 0001h
PRG4CON0_RG4REDG_MASK                    equ 0010h
PRG4CON0_RG4FEDG_POSN                    equ 0005h
PRG4CON0_RG4FEDG_POSITION                equ 0005h
PRG4CON0_RG4FEDG_SIZE                    equ 0001h
PRG4CON0_RG4FEDG_LENGTH                  equ 0001h
PRG4CON0_RG4FEDG_MASK                    equ 0020h
PRG4CON0_RG4EN_POSN                      equ 0007h
PRG4CON0_RG4EN_POSITION                  equ 0007h
PRG4CON0_RG4EN_SIZE                      equ 0001h
PRG4CON0_RG4EN_LENGTH                    equ 0001h
PRG4CON0_RG4EN_MASK                      equ 0080h
PRG4CON0_RG4MODE0_POSN                   equ 0002h
PRG4CON0_RG4MODE0_POSITION               equ 0002h
PRG4CON0_RG4MODE0_SIZE                   equ 0001h
PRG4CON0_RG4MODE0_LENGTH                 equ 0001h
PRG4CON0_RG4MODE0_MASK                   equ 0004h
PRG4CON0_RG4MODE1_POSN                   equ 0003h
PRG4CON0_RG4MODE1_POSITION               equ 0003h
PRG4CON0_RG4MODE1_SIZE                   equ 0001h
PRG4CON0_RG4MODE1_LENGTH                 equ 0001h
PRG4CON0_RG4MODE1_MASK                   equ 0008h

// Register: PRG4CON1
#define PRG4CON1 PRG4CON1
PRG4CON1                                 equ 0612h
// bitfield definitions
PRG4CON1_RPOL_POSN                       equ 0000h
PRG4CON1_RPOL_POSITION                   equ 0000h
PRG4CON1_RPOL_SIZE                       equ 0001h
PRG4CON1_RPOL_LENGTH                     equ 0001h
PRG4CON1_RPOL_MASK                       equ 0001h
PRG4CON1_FPOL_POSN                       equ 0001h
PRG4CON1_FPOL_POSITION                   equ 0001h
PRG4CON1_FPOL_SIZE                       equ 0001h
PRG4CON1_FPOL_LENGTH                     equ 0001h
PRG4CON1_FPOL_MASK                       equ 0002h
PRG4CON1_RDY_POSN                        equ 0002h
PRG4CON1_RDY_POSITION                    equ 0002h
PRG4CON1_RDY_SIZE                        equ 0001h
PRG4CON1_RDY_LENGTH                      equ 0001h
PRG4CON1_RDY_MASK                        equ 0004h
PRG4CON1_RG4RPOL_POSN                    equ 0000h
PRG4CON1_RG4RPOL_POSITION                equ 0000h
PRG4CON1_RG4RPOL_SIZE                    equ 0001h
PRG4CON1_RG4RPOL_LENGTH                  equ 0001h
PRG4CON1_RG4RPOL_MASK                    equ 0001h
PRG4CON1_RG4FPOL_POSN                    equ 0001h
PRG4CON1_RG4FPOL_POSITION                equ 0001h
PRG4CON1_RG4FPOL_SIZE                    equ 0001h
PRG4CON1_RG4FPOL_LENGTH                  equ 0001h
PRG4CON1_RG4FPOL_MASK                    equ 0002h
PRG4CON1_RG4RDY_POSN                     equ 0002h
PRG4CON1_RG4RDY_POSITION                 equ 0002h
PRG4CON1_RG4RDY_SIZE                     equ 0001h
PRG4CON1_RG4RDY_LENGTH                   equ 0001h
PRG4CON1_RG4RDY_MASK                     equ 0004h

// Register: PRG4CON2
#define PRG4CON2 PRG4CON2
PRG4CON2                                 equ 0613h
// bitfield definitions
PRG4CON2_ISET_POSN                       equ 0000h
PRG4CON2_ISET_POSITION                   equ 0000h
PRG4CON2_ISET_SIZE                       equ 0005h
PRG4CON2_ISET_LENGTH                     equ 0005h
PRG4CON2_ISET_MASK                       equ 001Fh
PRG4CON2_ISET0_POSN                      equ 0000h
PRG4CON2_ISET0_POSITION                  equ 0000h
PRG4CON2_ISET0_SIZE                      equ 0001h
PRG4CON2_ISET0_LENGTH                    equ 0001h
PRG4CON2_ISET0_MASK                      equ 0001h
PRG4CON2_ISET1_POSN                      equ 0001h
PRG4CON2_ISET1_POSITION                  equ 0001h
PRG4CON2_ISET1_SIZE                      equ 0001h
PRG4CON2_ISET1_LENGTH                    equ 0001h
PRG4CON2_ISET1_MASK                      equ 0002h
PRG4CON2_ISET2_POSN                      equ 0002h
PRG4CON2_ISET2_POSITION                  equ 0002h
PRG4CON2_ISET2_SIZE                      equ 0001h
PRG4CON2_ISET2_LENGTH                    equ 0001h
PRG4CON2_ISET2_MASK                      equ 0004h
PRG4CON2_ISET3_POSN                      equ 0003h
PRG4CON2_ISET3_POSITION                  equ 0003h
PRG4CON2_ISET3_SIZE                      equ 0001h
PRG4CON2_ISET3_LENGTH                    equ 0001h
PRG4CON2_ISET3_MASK                      equ 0008h
PRG4CON2_ISET4_POSN                      equ 0004h
PRG4CON2_ISET4_POSITION                  equ 0004h
PRG4CON2_ISET4_SIZE                      equ 0001h
PRG4CON2_ISET4_LENGTH                    equ 0001h
PRG4CON2_ISET4_MASK                      equ 0010h
PRG4CON2_RG4ISET_POSN                    equ 0000h
PRG4CON2_RG4ISET_POSITION                equ 0000h
PRG4CON2_RG4ISET_SIZE                    equ 0005h
PRG4CON2_RG4ISET_LENGTH                  equ 0005h
PRG4CON2_RG4ISET_MASK                    equ 001Fh
PRG4CON2_RG4ISET0_POSN                   equ 0000h
PRG4CON2_RG4ISET0_POSITION               equ 0000h
PRG4CON2_RG4ISET0_SIZE                   equ 0001h
PRG4CON2_RG4ISET0_LENGTH                 equ 0001h
PRG4CON2_RG4ISET0_MASK                   equ 0001h
PRG4CON2_RG4ISET1_POSN                   equ 0001h
PRG4CON2_RG4ISET1_POSITION               equ 0001h
PRG4CON2_RG4ISET1_SIZE                   equ 0001h
PRG4CON2_RG4ISET1_LENGTH                 equ 0001h
PRG4CON2_RG4ISET1_MASK                   equ 0002h
PRG4CON2_RG4ISET2_POSN                   equ 0002h
PRG4CON2_RG4ISET2_POSITION               equ 0002h
PRG4CON2_RG4ISET2_SIZE                   equ 0001h
PRG4CON2_RG4ISET2_LENGTH                 equ 0001h
PRG4CON2_RG4ISET2_MASK                   equ 0004h
PRG4CON2_RG4ISET3_POSN                   equ 0003h
PRG4CON2_RG4ISET3_POSITION               equ 0003h
PRG4CON2_RG4ISET3_SIZE                   equ 0001h
PRG4CON2_RG4ISET3_LENGTH                 equ 0001h
PRG4CON2_RG4ISET3_MASK                   equ 0008h
PRG4CON2_RG4ISET4_POSN                   equ 0004h
PRG4CON2_RG4ISET4_POSITION               equ 0004h
PRG4CON2_RG4ISET4_SIZE                   equ 0001h
PRG4CON2_RG4ISET4_LENGTH                 equ 0001h
PRG4CON2_RG4ISET4_MASK                   equ 0010h

