GopalSaraf/Practicals/PSDL/include/proc/pic16f1777.inc
// Register: PWM4CON
#define PWM4CON PWM4CON
PWM4CON                                  equ 0619h
// bitfield definitions
PWM4CON_POL_POSN                         equ 0004h
PWM4CON_POL_POSITION                     equ 0004h
PWM4CON_POL_SIZE                         equ 0001h
PWM4CON_POL_LENGTH                       equ 0001h
PWM4CON_POL_MASK                         equ 0010h
PWM4CON_OUT_POSN                         equ 0005h
PWM4CON_OUT_POSITION                     equ 0005h
PWM4CON_OUT_SIZE                         equ 0001h
PWM4CON_OUT_LENGTH                       equ 0001h
PWM4CON_OUT_MASK                         equ 0020h
PWM4CON_EN_POSN                          equ 0007h
PWM4CON_EN_POSITION                      equ 0007h
PWM4CON_EN_SIZE                          equ 0001h
PWM4CON_EN_LENGTH                        equ 0001h
PWM4CON_EN_MASK                          equ 0080h
PWM4CON_PWM4POL_POSN                     equ 0004h
PWM4CON_PWM4POL_POSITION                 equ 0004h
PWM4CON_PWM4POL_SIZE                     equ 0001h
PWM4CON_PWM4POL_LENGTH                   equ 0001h
PWM4CON_PWM4POL_MASK                     equ 0010h
PWM4CON_PWM4OUT_POSN                     equ 0005h
PWM4CON_PWM4OUT_POSITION                 equ 0005h
PWM4CON_PWM4OUT_SIZE                     equ 0001h
PWM4CON_PWM4OUT_LENGTH                   equ 0001h
PWM4CON_PWM4OUT_MASK                     equ 0020h
PWM4CON_PWM4EN_POSN                      equ 0007h
PWM4CON_PWM4EN_POSITION                  equ 0007h
PWM4CON_PWM4EN_SIZE                      equ 0001h
PWM4CON_PWM4EN_LENGTH                    equ 0001h
PWM4CON_PWM4EN_MASK                      equ 0080h

// Register: PWM9DCL
#define PWM9DCL PWM9DCL
PWM9DCL                                  equ 061Ah
// bitfield definitions
PWM9DCL_DC_POSN                          equ 0006h
PWM9DCL_DC_POSITION                      equ 0006h
PWM9DCL_DC_SIZE                          equ 0002h
PWM9DCL_DC_LENGTH                        equ 0002h
PWM9DCL_DC_MASK                          equ 00C0h
PWM9DCL_DC0_POSN                         equ 0006h
PWM9DCL_DC0_POSITION                     equ 0006h
PWM9DCL_DC0_SIZE                         equ 0001h
PWM9DCL_DC0_LENGTH                       equ 0001h
PWM9DCL_DC0_MASK                         equ 0040h
PWM9DCL_DC1_POSN                         equ 0007h
PWM9DCL_DC1_POSITION                     equ 0007h
PWM9DCL_DC1_SIZE                         equ 0001h
PWM9DCL_DC1_LENGTH                       equ 0001h
PWM9DCL_DC1_MASK                         equ 0080h
PWM9DCL_PWM9DC0_POSN                     equ 0006h
PWM9DCL_PWM9DC0_POSITION                 equ 0006h
PWM9DCL_PWM9DC0_SIZE                     equ 0001h
PWM9DCL_PWM9DC0_LENGTH                   equ 0001h
PWM9DCL_PWM9DC0_MASK                     equ 0040h
PWM9DCL_PWM9DC1_POSN                     equ 0007h
PWM9DCL_PWM9DC1_POSITION                 equ 0007h
PWM9DCL_PWM9DC1_SIZE                     equ 0001h
PWM9DCL_PWM9DC1_LENGTH                   equ 0001h
PWM9DCL_PWM9DC1_MASK                     equ 0080h
PWM9DCL_PWMPW0_POSN                      equ 0006h
PWM9DCL_PWMPW0_POSITION                  equ 0006h
PWM9DCL_PWMPW0_SIZE                      equ 0001h
PWM9DCL_PWMPW0_LENGTH                    equ 0001h
PWM9DCL_PWMPW0_MASK                      equ 0040h
PWM9DCL_PWMPW1_POSN                      equ 0007h
PWM9DCL_PWMPW1_POSITION                  equ 0007h
PWM9DCL_PWMPW1_SIZE                      equ 0001h
PWM9DCL_PWMPW1_LENGTH                    equ 0001h
PWM9DCL_PWMPW1_MASK                      equ 0080h

// Register: PWM9DCH
#define PWM9DCH PWM9DCH
PWM9DCH                                  equ 061Bh
// bitfield definitions
PWM9DCH_DC_POSN                          equ 0000h
PWM9DCH_DC_POSITION                      equ 0000h
PWM9DCH_DC_SIZE                          equ 0008h
PWM9DCH_DC_LENGTH                        equ 0008h
PWM9DCH_DC_MASK                          equ 00FFh
PWM9DCH_DC2_POSN                         equ 0000h
PWM9DCH_DC2_POSITION                     equ 0000h
PWM9DCH_DC2_SIZE                         equ 0001h
PWM9DCH_DC2_LENGTH                       equ 0001h
PWM9DCH_DC2_MASK                         equ 0001h
PWM9DCH_DC3_POSN                         equ 0001h
PWM9DCH_DC3_POSITION                     equ 0001h
PWM9DCH_DC3_SIZE                         equ 0001h
PWM9DCH_DC3_LENGTH                       equ 0001h
PWM9DCH_DC3_MASK                         equ 0002h
PWM9DCH_DC4_POSN                         equ 0002h
PWM9DCH_DC4_POSITION                     equ 0002h
PWM9DCH_DC4_SIZE                         equ 0001h
PWM9DCH_DC4_LENGTH                       equ 0001h
PWM9DCH_DC4_MASK                         equ 0004h
PWM9DCH_DC5_POSN                         equ 0003h
PWM9DCH_DC5_POSITION                     equ 0003h
PWM9DCH_DC5_SIZE                         equ 0001h
PWM9DCH_DC5_LENGTH                       equ 0001h
PWM9DCH_DC5_MASK                         equ 0008h
PWM9DCH_DC6_POSN                         equ 0004h
PWM9DCH_DC6_POSITION                     equ 0004h
PWM9DCH_DC6_SIZE                         equ 0001h
PWM9DCH_DC6_LENGTH                       equ 0001h
PWM9DCH_DC6_MASK                         equ 0010h
PWM9DCH_DC7_POSN                         equ 0005h
PWM9DCH_DC7_POSITION                     equ 0005h
PWM9DCH_DC7_SIZE                         equ 0001h
PWM9DCH_DC7_LENGTH                       equ 0001h
PWM9DCH_DC7_MASK                         equ 0020h
PWM9DCH_DC8_POSN                         equ 0006h
PWM9DCH_DC8_POSITION                     equ 0006h
PWM9DCH_DC8_SIZE                         equ 0001h
PWM9DCH_DC8_LENGTH                       equ 0001h
PWM9DCH_DC8_MASK                         equ 0040h
PWM9DCH_DC9_POSN                         equ 0007h
PWM9DCH_DC9_POSITION                     equ 0007h
PWM9DCH_DC9_SIZE                         equ 0001h
PWM9DCH_DC9_LENGTH                       equ 0001h
PWM9DCH_DC9_MASK                         equ 0080h
PWM9DCH_PWM9DC2_POSN                     equ 0000h
PWM9DCH_PWM9DC2_POSITION                 equ 0000h
PWM9DCH_PWM9DC2_SIZE                     equ 0001h
PWM9DCH_PWM9DC2_LENGTH                   equ 0001h
PWM9DCH_PWM9DC2_MASK                     equ 0001h
PWM9DCH_PWM9DC3_POSN                     equ 0001h
PWM9DCH_PWM9DC3_POSITION                 equ 0001h
PWM9DCH_PWM9DC3_SIZE                     equ 0001h
PWM9DCH_PWM9DC3_LENGTH                   equ 0001h
PWM9DCH_PWM9DC3_MASK                     equ 0002h
PWM9DCH_PWM9DC4_POSN                     equ 0002h
PWM9DCH_PWM9DC4_POSITION                 equ 0002h
PWM9DCH_PWM9DC4_SIZE                     equ 0001h
PWM9DCH_PWM9DC4_LENGTH                   equ 0001h
PWM9DCH_PWM9DC4_MASK                     equ 0004h
PWM9DCH_PWM9DC5_POSN                     equ 0003h
PWM9DCH_PWM9DC5_POSITION                 equ 0003h
PWM9DCH_PWM9DC5_SIZE                     equ 0001h
PWM9DCH_PWM9DC5_LENGTH                   equ 0001h
PWM9DCH_PWM9DC5_MASK                     equ 0008h
PWM9DCH_PWM9DC6_POSN                     equ 0004h
PWM9DCH_PWM9DC6_POSITION                 equ 0004h
PWM9DCH_PWM9DC6_SIZE                     equ 0001h
PWM9DCH_PWM9DC6_LENGTH                   equ 0001h
PWM9DCH_PWM9DC6_MASK                     equ 0010h
PWM9DCH_PWM9DC7_POSN                     equ 0005h
PWM9DCH_PWM9DC7_POSITION                 equ 0005h
PWM9DCH_PWM9DC7_SIZE                     equ 0001h
PWM9DCH_PWM9DC7_LENGTH                   equ 0001h
PWM9DCH_PWM9DC7_MASK                     equ 0020h
PWM9DCH_PWM9DC8_POSN                     equ 0006h
PWM9DCH_PWM9DC8_POSITION                 equ 0006h
PWM9DCH_PWM9DC8_SIZE                     equ 0001h
PWM9DCH_PWM9DC8_LENGTH                   equ 0001h
PWM9DCH_PWM9DC8_MASK                     equ 0040h
PWM9DCH_PWM9DC9_POSN                     equ 0007h
PWM9DCH_PWM9DC9_POSITION                 equ 0007h
PWM9DCH_PWM9DC9_SIZE                     equ 0001h
PWM9DCH_PWM9DC9_LENGTH                   equ 0001h
PWM9DCH_PWM9DC9_MASK                     equ 0080h
PWM9DCH_PWMPW2_POSN                      equ 0000h
PWM9DCH_PWMPW2_POSITION                  equ 0000h
PWM9DCH_PWMPW2_SIZE                      equ 0001h
PWM9DCH_PWMPW2_LENGTH                    equ 0001h
PWM9DCH_PWMPW2_MASK                      equ 0001h
PWM9DCH_PWMPW3_POSN                      equ 0001h
PWM9DCH_PWMPW3_POSITION                  equ 0001h
PWM9DCH_PWMPW3_SIZE                      equ 0001h
PWM9DCH_PWMPW3_LENGTH                    equ 0001h
PWM9DCH_PWMPW3_MASK                      equ 0002h
PWM9DCH_PWMPW4_POSN                      equ 0002h
PWM9DCH_PWMPW4_POSITION                  equ 0002h
PWM9DCH_PWMPW4_SIZE                      equ 0001h
PWM9DCH_PWMPW4_LENGTH                    equ 0001h
PWM9DCH_PWMPW4_MASK                      equ 0004h
PWM9DCH_PWMPW5_POSN                      equ 0003h
PWM9DCH_PWMPW5_POSITION                  equ 0003h
PWM9DCH_PWMPW5_SIZE                      equ 0001h
PWM9DCH_PWMPW5_LENGTH                    equ 0001h
PWM9DCH_PWMPW5_MASK                      equ 0008h
PWM9DCH_PWMPW6_POSN                      equ 0004h
PWM9DCH_PWMPW6_POSITION                  equ 0004h
PWM9DCH_PWMPW6_SIZE                      equ 0001h
PWM9DCH_PWMPW6_LENGTH                    equ 0001h
PWM9DCH_PWMPW6_MASK                      equ 0010h
PWM9DCH_PWMPW7_POSN                      equ 0005h
PWM9DCH_PWMPW7_POSITION                  equ 0005h
PWM9DCH_PWMPW7_SIZE                      equ 0001h
PWM9DCH_PWMPW7_LENGTH                    equ 0001h
PWM9DCH_PWMPW7_MASK                      equ 0020h
PWM9DCH_PWMPW8_POSN                      equ 0006h
PWM9DCH_PWMPW8_POSITION                  equ 0006h
PWM9DCH_PWMPW8_SIZE                      equ 0001h
PWM9DCH_PWMPW8_LENGTH                    equ 0001h
PWM9DCH_PWMPW8_MASK                      equ 0040h
PWM9DCH_PWMPW9_POSN                      equ 0007h
PWM9DCH_PWMPW9_POSITION                  equ 0007h
PWM9DCH_PWMPW9_SIZE                      equ 0001h
PWM9DCH_PWMPW9_LENGTH                    equ 0001h
PWM9DCH_PWMPW9_MASK                      equ 0080h

// Register: PWM9CON
#define PWM9CON PWM9CON
PWM9CON                                  equ 061Ch
// bitfield definitions
PWM9CON_POL_POSN                         equ 0004h
PWM9CON_POL_POSITION                     equ 0004h
PWM9CON_POL_SIZE                         equ 0001h
PWM9CON_POL_LENGTH                       equ 0001h
PWM9CON_POL_MASK                         equ 0010h
PWM9CON_OUT_POSN                         equ 0005h
PWM9CON_OUT_POSITION                     equ 0005h
PWM9CON_OUT_SIZE                         equ 0001h
PWM9CON_OUT_LENGTH                       equ 0001h
PWM9CON_OUT_MASK                         equ 0020h
PWM9CON_EN_POSN                          equ 0007h
PWM9CON_EN_POSITION                      equ 0007h
PWM9CON_EN_SIZE                          equ 0001h
PWM9CON_EN_LENGTH                        equ 0001h
PWM9CON_EN_MASK                          equ 0080h
PWM9CON_PWM9POL_POSN                     equ 0004h
PWM9CON_PWM9POL_POSITION                 equ 0004h
PWM9CON_PWM9POL_SIZE                     equ 0001h
PWM9CON_PWM9POL_LENGTH                   equ 0001h
PWM9CON_PWM9POL_MASK                     equ 0010h
PWM9CON_PWM9OUT_POSN                     equ 0005h
PWM9CON_PWM9OUT_POSITION                 equ 0005h
PWM9CON_PWM9OUT_SIZE                     equ 0001h
PWM9CON_PWM9OUT_LENGTH                   equ 0001h
PWM9CON_PWM9OUT_MASK                     equ 0020h
PWM9CON_PWM9EN_POSN                      equ 0007h
PWM9CON_PWM9EN_POSITION                  equ 0007h
PWM9CON_PWM9EN_SIZE                      equ 0001h
PWM9CON_PWM9EN_LENGTH                    equ 0001h
PWM9CON_PWM9EN_MASK                      equ 0080h

// Register: PWM10DCL
#define PWM10DCL PWM10DCL
PWM10DCL                                 equ 061Dh
// bitfield definitions
PWM10DCL_DC_POSN                         equ 0006h
PWM10DCL_DC_POSITION                     equ 0006h
PWM10DCL_DC_SIZE                         equ 0002h
PWM10DCL_DC_LENGTH                       equ 0002h
PWM10DCL_DC_MASK                         equ 00C0h
PWM10DCL_DC0_POSN                        equ 0006h
PWM10DCL_DC0_POSITION                    equ 0006h
PWM10DCL_DC0_SIZE                        equ 0001h
PWM10DCL_DC0_LENGTH                      equ 0001h
PWM10DCL_DC0_MASK                        equ 0040h
PWM10DCL_DC1_POSN                        equ 0007h
PWM10DCL_DC1_POSITION                    equ 0007h
PWM10DCL_DC1_SIZE                        equ 0001h
PWM10DCL_DC1_LENGTH                      equ 0001h
PWM10DCL_DC1_MASK                        equ 0080h
PWM10DCL_PWM10DC0_POSN                   equ 0006h
PWM10DCL_PWM10DC0_POSITION               equ 0006h
PWM10DCL_PWM10DC0_SIZE                   equ 0001h
PWM10DCL_PWM10DC0_LENGTH                 equ 0001h
PWM10DCL_PWM10DC0_MASK                   equ 0040h
PWM10DCL_PWM10DC1_POSN                   equ 0007h
PWM10DCL_PWM10DC1_POSITION               equ 0007h
PWM10DCL_PWM10DC1_SIZE                   equ 0001h
PWM10DCL_PWM10DC1_LENGTH                 equ 0001h
PWM10DCL_PWM10DC1_MASK                   equ 0080h
PWM10DCL_PWMPW0_POSN                     equ 0006h
PWM10DCL_PWMPW0_POSITION                 equ 0006h
PWM10DCL_PWMPW0_SIZE                     equ 0001h
PWM10DCL_PWMPW0_LENGTH                   equ 0001h
PWM10DCL_PWMPW0_MASK                     equ 0040h
PWM10DCL_PWMPW1_POSN                     equ 0007h
PWM10DCL_PWMPW1_POSITION                 equ 0007h
PWM10DCL_PWMPW1_SIZE                     equ 0001h
PWM10DCL_PWMPW1_LENGTH                   equ 0001h
PWM10DCL_PWMPW1_MASK                     equ 0080h

// Register: PWM10DCH
#define PWM10DCH PWM10DCH
PWM10DCH                                 equ 061Eh
// bitfield definitions
PWM10DCH_DC_POSN                         equ 0000h
PWM10DCH_DC_POSITION                     equ 0000h
PWM10DCH_DC_SIZE                         equ 0008h
PWM10DCH_DC_LENGTH                       equ 0008h
PWM10DCH_DC_MASK                         equ 00FFh
PWM10DCH_DC2_POSN                        equ 0000h
PWM10DCH_DC2_POSITION                    equ 0000h
PWM10DCH_DC2_SIZE                        equ 0001h
PWM10DCH_DC2_LENGTH                      equ 0001h
PWM10DCH_DC2_MASK                        equ 0001h
PWM10DCH_DC3_POSN                        equ 0001h
PWM10DCH_DC3_POSITION                    equ 0001h
PWM10DCH_DC3_SIZE                        equ 0001h
PWM10DCH_DC3_LENGTH                      equ 0001h
PWM10DCH_DC3_MASK                        equ 0002h
PWM10DCH_DC4_POSN                        equ 0002h
PWM10DCH_DC4_POSITION                    equ 0002h
PWM10DCH_DC4_SIZE                        equ 0001h
PWM10DCH_DC4_LENGTH                      equ 0001h
PWM10DCH_DC4_MASK                        equ 0004h
PWM10DCH_DC5_POSN                        equ 0003h
PWM10DCH_DC5_POSITION                    equ 0003h
PWM10DCH_DC5_SIZE                        equ 0001h
PWM10DCH_DC5_LENGTH                      equ 0001h
PWM10DCH_DC5_MASK                        equ 0008h
PWM10DCH_DC6_POSN                        equ 0004h
PWM10DCH_DC6_POSITION                    equ 0004h
PWM10DCH_DC6_SIZE                        equ 0001h
PWM10DCH_DC6_LENGTH                      equ 0001h
PWM10DCH_DC6_MASK                        equ 0010h
PWM10DCH_DC7_POSN                        equ 0005h
PWM10DCH_DC7_POSITION                    equ 0005h
PWM10DCH_DC7_SIZE                        equ 0001h
PWM10DCH_DC7_LENGTH                      equ 0001h
PWM10DCH_DC7_MASK                        equ 0020h
PWM10DCH_DC8_POSN                        equ 0006h
PWM10DCH_DC8_POSITION                    equ 0006h
PWM10DCH_DC8_SIZE                        equ 0001h
PWM10DCH_DC8_LENGTH                      equ 0001h
PWM10DCH_DC8_MASK                        equ 0040h
PWM10DCH_DC9_POSN                        equ 0007h
PWM10DCH_DC9_POSITION                    equ 0007h
PWM10DCH_DC9_SIZE                        equ 0001h
PWM10DCH_DC9_LENGTH                      equ 0001h
PWM10DCH_DC9_MASK                        equ 0080h
PWM10DCH_PWM10DC2_POSN                   equ 0000h
PWM10DCH_PWM10DC2_POSITION               equ 0000h
PWM10DCH_PWM10DC2_SIZE                   equ 0001h
PWM10DCH_PWM10DC2_LENGTH                 equ 0001h
PWM10DCH_PWM10DC2_MASK                   equ 0001h
PWM10DCH_PWM10DC3_POSN                   equ 0001h
PWM10DCH_PWM10DC3_POSITION               equ 0001h
PWM10DCH_PWM10DC3_SIZE                   equ 0001h
PWM10DCH_PWM10DC3_LENGTH                 equ 0001h
PWM10DCH_PWM10DC3_MASK                   equ 0002h
PWM10DCH_PWM10DC4_POSN                   equ 0002h
PWM10DCH_PWM10DC4_POSITION               equ 0002h
PWM10DCH_PWM10DC4_SIZE                   equ 0001h
PWM10DCH_PWM10DC4_LENGTH                 equ 0001h
PWM10DCH_PWM10DC4_MASK                   equ 0004h
PWM10DCH_PWM10DC5_POSN                   equ 0003h
PWM10DCH_PWM10DC5_POSITION               equ 0003h
PWM10DCH_PWM10DC5_SIZE                   equ 0001h
PWM10DCH_PWM10DC5_LENGTH                 equ 0001h
PWM10DCH_PWM10DC5_MASK                   equ 0008h
PWM10DCH_PWM10DC6_POSN                   equ 0004h
PWM10DCH_PWM10DC6_POSITION               equ 0004h
PWM10DCH_PWM10DC6_SIZE                   equ 0001h
PWM10DCH_PWM10DC6_LENGTH                 equ 0001h
PWM10DCH_PWM10DC6_MASK                   equ 0010h
PWM10DCH_PWM10DC7_POSN                   equ 0005h
PWM10DCH_PWM10DC7_POSITION               equ 0005h
PWM10DCH_PWM10DC7_SIZE                   equ 0001h
PWM10DCH_PWM10DC7_LENGTH                 equ 0001h
PWM10DCH_PWM10DC7_MASK                   equ 0020h
PWM10DCH_PWM10DC8_POSN                   equ 0006h
PWM10DCH_PWM10DC8_POSITION               equ 0006h
PWM10DCH_PWM10DC8_SIZE                   equ 0001h
PWM10DCH_PWM10DC8_LENGTH                 equ 0001h
PWM10DCH_PWM10DC8_MASK                   equ 0040h
PWM10DCH_PWM10DC9_POSN                   equ 0007h
PWM10DCH_PWM10DC9_POSITION               equ 0007h
PWM10DCH_PWM10DC9_SIZE                   equ 0001h
PWM10DCH_PWM10DC9_LENGTH                 equ 0001h
PWM10DCH_PWM10DC9_MASK                   equ 0080h
PWM10DCH_PWMPW2_POSN                     equ 0000h
PWM10DCH_PWMPW2_POSITION                 equ 0000h
PWM10DCH_PWMPW2_SIZE                     equ 0001h
PWM10DCH_PWMPW2_LENGTH                   equ 0001h
PWM10DCH_PWMPW2_MASK                     equ 0001h
PWM10DCH_PWMPW3_POSN                     equ 0001h
PWM10DCH_PWMPW3_POSITION                 equ 0001h
PWM10DCH_PWMPW3_SIZE                     equ 0001h
PWM10DCH_PWMPW3_LENGTH                   equ 0001h
PWM10DCH_PWMPW3_MASK                     equ 0002h
PWM10DCH_PWMPW4_POSN                     equ 0002h
PWM10DCH_PWMPW4_POSITION                 equ 0002h
PWM10DCH_PWMPW4_SIZE                     equ 0001h
PWM10DCH_PWMPW4_LENGTH                   equ 0001h
PWM10DCH_PWMPW4_MASK                     equ 0004h
PWM10DCH_PWMPW5_POSN                     equ 0003h
PWM10DCH_PWMPW5_POSITION                 equ 0003h
PWM10DCH_PWMPW5_SIZE                     equ 0001h
PWM10DCH_PWMPW5_LENGTH                   equ 0001h
PWM10DCH_PWMPW5_MASK                     equ 0008h
PWM10DCH_PWMPW6_POSN                     equ 0004h
PWM10DCH_PWMPW6_POSITION                 equ 0004h
PWM10DCH_PWMPW6_SIZE                     equ 0001h
PWM10DCH_PWMPW6_LENGTH                   equ 0001h
PWM10DCH_PWMPW6_MASK                     equ 0010h
PWM10DCH_PWMPW7_POSN                     equ 0005h
PWM10DCH_PWMPW7_POSITION                 equ 0005h
PWM10DCH_PWMPW7_SIZE                     equ 0001h
PWM10DCH_PWMPW7_LENGTH                   equ 0001h
PWM10DCH_PWMPW7_MASK                     equ 0020h
PWM10DCH_PWMPW8_POSN                     equ 0006h
PWM10DCH_PWMPW8_POSITION                 equ 0006h
PWM10DCH_PWMPW8_SIZE                     equ 0001h
PWM10DCH_PWMPW8_LENGTH                   equ 0001h
PWM10DCH_PWMPW8_MASK                     equ 0040h
PWM10DCH_PWMPW9_POSN                     equ 0007h
PWM10DCH_PWMPW9_POSITION                 equ 0007h
PWM10DCH_PWMPW9_SIZE                     equ 0001h
PWM10DCH_PWMPW9_LENGTH                   equ 0001h
PWM10DCH_PWMPW9_MASK                     equ 0080h

// Register: PWM10CON
#define PWM10CON PWM10CON
PWM10CON                                 equ 061Fh
// bitfield definitions
PWM10CON_POL_POSN                        equ 0004h
PWM10CON_POL_POSITION                    equ 0004h
PWM10CON_POL_SIZE                        equ 0001h
PWM10CON_POL_LENGTH                      equ 0001h
PWM10CON_POL_MASK                        equ 0010h
PWM10CON_OUT_POSN                        equ 0005h
PWM10CON_OUT_POSITION                    equ 0005h
PWM10CON_OUT_SIZE                        equ 0001h
PWM10CON_OUT_LENGTH                      equ 0001h
PWM10CON_OUT_MASK                        equ 0020h
PWM10CON_EN_POSN                         equ 0007h
PWM10CON_EN_POSITION                     equ 0007h
PWM10CON_EN_SIZE                         equ 0001h
PWM10CON_EN_LENGTH                       equ 0001h
PWM10CON_EN_MASK                         equ 0080h
PWM10CON_PWM10POL_POSN                   equ 0004h
PWM10CON_PWM10POL_POSITION               equ 0004h
PWM10CON_PWM10POL_SIZE                   equ 0001h
PWM10CON_PWM10POL_LENGTH                 equ 0001h
PWM10CON_PWM10POL_MASK                   equ 0010h
PWM10CON_PWM10OUT_POSN                   equ 0005h
PWM10CON_PWM10OUT_POSITION               equ 0005h
PWM10CON_PWM10OUT_SIZE                   equ 0001h
PWM10CON_PWM10OUT_LENGTH                 equ 0001h
PWM10CON_PWM10OUT_MASK                   equ 0020h
PWM10CON_PWM10EN_POSN                    equ 0007h
PWM10CON_PWM10EN_POSITION                equ 0007h
PWM10CON_PWM10EN_SIZE                    equ 0001h
PWM10CON_PWM10EN_LENGTH                  equ 0001h
PWM10CON_PWM10EN_MASK                    equ 0080h

