GopalSaraf/Practicals/PSDL/include/proc/pic16f1777.inc
// Register: COG2CON1
#define COG2CON1 COG2CON1
COG2CON1                                 equ 0714h
// bitfield definitions
COG2CON1_POLA_POSN                       equ 0000h
COG2CON1_POLA_POSITION                   equ 0000h
COG2CON1_POLA_SIZE                       equ 0001h
COG2CON1_POLA_LENGTH                     equ 0001h
COG2CON1_POLA_MASK                       equ 0001h
COG2CON1_POLB_POSN                       equ 0001h
COG2CON1_POLB_POSITION                   equ 0001h
COG2CON1_POLB_SIZE                       equ 0001h
COG2CON1_POLB_LENGTH                     equ 0001h
COG2CON1_POLB_MASK                       equ 0002h
COG2CON1_POLC_POSN                       equ 0002h
COG2CON1_POLC_POSITION                   equ 0002h
COG2CON1_POLC_SIZE                       equ 0001h
COG2CON1_POLC_LENGTH                     equ 0001h
COG2CON1_POLC_MASK                       equ 0004h
COG2CON1_POLD_POSN                       equ 0003h
COG2CON1_POLD_POSITION                   equ 0003h
COG2CON1_POLD_SIZE                       equ 0001h
COG2CON1_POLD_LENGTH                     equ 0001h
COG2CON1_POLD_MASK                       equ 0008h
COG2CON1_FDBS_POSN                       equ 0006h
COG2CON1_FDBS_POSITION                   equ 0006h
COG2CON1_FDBS_SIZE                       equ 0001h
COG2CON1_FDBS_LENGTH                     equ 0001h
COG2CON1_FDBS_MASK                       equ 0040h
COG2CON1_RDBS_POSN                       equ 0007h
COG2CON1_RDBS_POSITION                   equ 0007h
COG2CON1_RDBS_SIZE                       equ 0001h
COG2CON1_RDBS_LENGTH                     equ 0001h
COG2CON1_RDBS_MASK                       equ 0080h
COG2CON1_G2POLA_POSN                     equ 0000h
COG2CON1_G2POLA_POSITION                 equ 0000h
COG2CON1_G2POLA_SIZE                     equ 0001h
COG2CON1_G2POLA_LENGTH                   equ 0001h
COG2CON1_G2POLA_MASK                     equ 0001h
COG2CON1_G2POLB_POSN                     equ 0001h
COG2CON1_G2POLB_POSITION                 equ 0001h
COG2CON1_G2POLB_SIZE                     equ 0001h
COG2CON1_G2POLB_LENGTH                   equ 0001h
COG2CON1_G2POLB_MASK                     equ 0002h
COG2CON1_G2POLC_POSN                     equ 0002h
COG2CON1_G2POLC_POSITION                 equ 0002h
COG2CON1_G2POLC_SIZE                     equ 0001h
COG2CON1_G2POLC_LENGTH                   equ 0001h
COG2CON1_G2POLC_MASK                     equ 0004h
COG2CON1_G2POLD_POSN                     equ 0003h
COG2CON1_G2POLD_POSITION                 equ 0003h
COG2CON1_G2POLD_SIZE                     equ 0001h
COG2CON1_G2POLD_LENGTH                   equ 0001h
COG2CON1_G2POLD_MASK                     equ 0008h
COG2CON1_G2FDBS_POSN                     equ 0006h
COG2CON1_G2FDBS_POSITION                 equ 0006h
COG2CON1_G2FDBS_SIZE                     equ 0001h
COG2CON1_G2FDBS_LENGTH                   equ 0001h
COG2CON1_G2FDBS_MASK                     equ 0040h
COG2CON1_G2RDBS_POSN                     equ 0007h
COG2CON1_G2RDBS_POSITION                 equ 0007h
COG2CON1_G2RDBS_SIZE                     equ 0001h
COG2CON1_G2RDBS_LENGTH                   equ 0001h
COG2CON1_G2RDBS_MASK                     equ 0080h

// Register: COG2RIS0
#define COG2RIS0 COG2RIS0
COG2RIS0                                 equ 0715h
// bitfield definitions
COG2RIS0_RIS0_POSN                       equ 0000h
COG2RIS0_RIS0_POSITION                   equ 0000h
COG2RIS0_RIS0_SIZE                       equ 0001h
COG2RIS0_RIS0_LENGTH                     equ 0001h
COG2RIS0_RIS0_MASK                       equ 0001h
COG2RIS0_RIS1_POSN                       equ 0001h
COG2RIS0_RIS1_POSITION                   equ 0001h
COG2RIS0_RIS1_SIZE                       equ 0001h
COG2RIS0_RIS1_LENGTH                     equ 0001h
COG2RIS0_RIS1_MASK                       equ 0002h
COG2RIS0_RIS2_POSN                       equ 0002h
COG2RIS0_RIS2_POSITION                   equ 0002h
COG2RIS0_RIS2_SIZE                       equ 0001h
COG2RIS0_RIS2_LENGTH                     equ 0001h
COG2RIS0_RIS2_MASK                       equ 0004h
COG2RIS0_RIS3_POSN                       equ 0003h
COG2RIS0_RIS3_POSITION                   equ 0003h
COG2RIS0_RIS3_SIZE                       equ 0001h
COG2RIS0_RIS3_LENGTH                     equ 0001h
COG2RIS0_RIS3_MASK                       equ 0008h
COG2RIS0_RIS4_POSN                       equ 0004h
COG2RIS0_RIS4_POSITION                   equ 0004h
COG2RIS0_RIS4_SIZE                       equ 0001h
COG2RIS0_RIS4_LENGTH                     equ 0001h
COG2RIS0_RIS4_MASK                       equ 0010h
COG2RIS0_RIS5_POSN                       equ 0005h
COG2RIS0_RIS5_POSITION                   equ 0005h
COG2RIS0_RIS5_SIZE                       equ 0001h
COG2RIS0_RIS5_LENGTH                     equ 0001h
COG2RIS0_RIS5_MASK                       equ 0020h
COG2RIS0_RIS6_POSN                       equ 0006h
COG2RIS0_RIS6_POSITION                   equ 0006h
COG2RIS0_RIS6_SIZE                       equ 0001h
COG2RIS0_RIS6_LENGTH                     equ 0001h
COG2RIS0_RIS6_MASK                       equ 0040h
COG2RIS0_RIS7_POSN                       equ 0007h
COG2RIS0_RIS7_POSITION                   equ 0007h
COG2RIS0_RIS7_SIZE                       equ 0001h
COG2RIS0_RIS7_LENGTH                     equ 0001h
COG2RIS0_RIS7_MASK                       equ 0080h
COG2RIS0_G2RIS0_POSN                     equ 0000h
COG2RIS0_G2RIS0_POSITION                 equ 0000h
COG2RIS0_G2RIS0_SIZE                     equ 0001h
COG2RIS0_G2RIS0_LENGTH                   equ 0001h
COG2RIS0_G2RIS0_MASK                     equ 0001h
COG2RIS0_G2RIS1_POSN                     equ 0001h
COG2RIS0_G2RIS1_POSITION                 equ 0001h
COG2RIS0_G2RIS1_SIZE                     equ 0001h
COG2RIS0_G2RIS1_LENGTH                   equ 0001h
COG2RIS0_G2RIS1_MASK                     equ 0002h
COG2RIS0_G2RIS2_POSN                     equ 0002h
COG2RIS0_G2RIS2_POSITION                 equ 0002h
COG2RIS0_G2RIS2_SIZE                     equ 0001h
COG2RIS0_G2RIS2_LENGTH                   equ 0001h
COG2RIS0_G2RIS2_MASK                     equ 0004h
COG2RIS0_G2RIS3_POSN                     equ 0003h
COG2RIS0_G2RIS3_POSITION                 equ 0003h
COG2RIS0_G2RIS3_SIZE                     equ 0001h
COG2RIS0_G2RIS3_LENGTH                   equ 0001h
COG2RIS0_G2RIS3_MASK                     equ 0008h
COG2RIS0_G2RIS4_POSN                     equ 0004h
COG2RIS0_G2RIS4_POSITION                 equ 0004h
COG2RIS0_G2RIS4_SIZE                     equ 0001h
COG2RIS0_G2RIS4_LENGTH                   equ 0001h
COG2RIS0_G2RIS4_MASK                     equ 0010h
COG2RIS0_G2RIS5_POSN                     equ 0005h
COG2RIS0_G2RIS5_POSITION                 equ 0005h
COG2RIS0_G2RIS5_SIZE                     equ 0001h
COG2RIS0_G2RIS5_LENGTH                   equ 0001h
COG2RIS0_G2RIS5_MASK                     equ 0020h
COG2RIS0_G2RIS6_POSN                     equ 0006h
COG2RIS0_G2RIS6_POSITION                 equ 0006h
COG2RIS0_G2RIS6_SIZE                     equ 0001h
COG2RIS0_G2RIS6_LENGTH                   equ 0001h
COG2RIS0_G2RIS6_MASK                     equ 0040h
COG2RIS0_G2RIS7_POSN                     equ 0007h
COG2RIS0_G2RIS7_POSITION                 equ 0007h
COG2RIS0_G2RIS7_SIZE                     equ 0001h
COG2RIS0_G2RIS7_LENGTH                   equ 0001h
COG2RIS0_G2RIS7_MASK                     equ 0080h

// Register: COG2RIS1
#define COG2RIS1 COG2RIS1
COG2RIS1                                 equ 0716h
// bitfield definitions
COG2RIS1_RIS8_POSN                       equ 0000h
COG2RIS1_RIS8_POSITION                   equ 0000h
COG2RIS1_RIS8_SIZE                       equ 0001h
COG2RIS1_RIS8_LENGTH                     equ 0001h
COG2RIS1_RIS8_MASK                       equ 0001h
COG2RIS1_RIS9_POSN                       equ 0001h
COG2RIS1_RIS9_POSITION                   equ 0001h
COG2RIS1_RIS9_SIZE                       equ 0001h
COG2RIS1_RIS9_LENGTH                     equ 0001h
COG2RIS1_RIS9_MASK                       equ 0002h
COG2RIS1_RIS10_POSN                      equ 0002h
COG2RIS1_RIS10_POSITION                  equ 0002h
COG2RIS1_RIS10_SIZE                      equ 0001h
COG2RIS1_RIS10_LENGTH                    equ 0001h
COG2RIS1_RIS10_MASK                      equ 0004h
COG2RIS1_RIS11_POSN                      equ 0003h
COG2RIS1_RIS11_POSITION                  equ 0003h
COG2RIS1_RIS11_SIZE                      equ 0001h
COG2RIS1_RIS11_LENGTH                    equ 0001h
COG2RIS1_RIS11_MASK                      equ 0008h
COG2RIS1_RIS12_POSN                      equ 0004h
COG2RIS1_RIS12_POSITION                  equ 0004h
COG2RIS1_RIS12_SIZE                      equ 0001h
COG2RIS1_RIS12_LENGTH                    equ 0001h
COG2RIS1_RIS12_MASK                      equ 0010h
COG2RIS1_RIS13_POSN                      equ 0005h
COG2RIS1_RIS13_POSITION                  equ 0005h
COG2RIS1_RIS13_SIZE                      equ 0001h
COG2RIS1_RIS13_LENGTH                    equ 0001h
COG2RIS1_RIS13_MASK                      equ 0020h
COG2RIS1_RIS14_POSN                      equ 0006h
COG2RIS1_RIS14_POSITION                  equ 0006h
COG2RIS1_RIS14_SIZE                      equ 0001h
COG2RIS1_RIS14_LENGTH                    equ 0001h
COG2RIS1_RIS14_MASK                      equ 0040h
COG2RIS1_RIS15_POSN                      equ 0007h
COG2RIS1_RIS15_POSITION                  equ 0007h
COG2RIS1_RIS15_SIZE                      equ 0001h
COG2RIS1_RIS15_LENGTH                    equ 0001h
COG2RIS1_RIS15_MASK                      equ 0080h
COG2RIS1_G2RIS8_POSN                     equ 0000h
COG2RIS1_G2RIS8_POSITION                 equ 0000h
COG2RIS1_G2RIS8_SIZE                     equ 0001h
COG2RIS1_G2RIS8_LENGTH                   equ 0001h
COG2RIS1_G2RIS8_MASK                     equ 0001h
COG2RIS1_G2RIS9_POSN                     equ 0001h
COG2RIS1_G2RIS9_POSITION                 equ 0001h
COG2RIS1_G2RIS9_SIZE                     equ 0001h
COG2RIS1_G2RIS9_LENGTH                   equ 0001h
COG2RIS1_G2RIS9_MASK                     equ 0002h
COG2RIS1_G2RIS10_POSN                    equ 0002h
COG2RIS1_G2RIS10_POSITION                equ 0002h
COG2RIS1_G2RIS10_SIZE                    equ 0001h
COG2RIS1_G2RIS10_LENGTH                  equ 0001h
COG2RIS1_G2RIS10_MASK                    equ 0004h
COG2RIS1_G2RIS11_POSN                    equ 0003h
COG2RIS1_G2RIS11_POSITION                equ 0003h
COG2RIS1_G2RIS11_SIZE                    equ 0001h
COG2RIS1_G2RIS11_LENGTH                  equ 0001h
COG2RIS1_G2RIS11_MASK                    equ 0008h
COG2RIS1_G2RIS12_POSN                    equ 0004h
COG2RIS1_G2RIS12_POSITION                equ 0004h
COG2RIS1_G2RIS12_SIZE                    equ 0001h
COG2RIS1_G2RIS12_LENGTH                  equ 0001h
COG2RIS1_G2RIS12_MASK                    equ 0010h
COG2RIS1_G2RIS13_POSN                    equ 0005h
COG2RIS1_G2RIS13_POSITION                equ 0005h
COG2RIS1_G2RIS13_SIZE                    equ 0001h
COG2RIS1_G2RIS13_LENGTH                  equ 0001h
COG2RIS1_G2RIS13_MASK                    equ 0020h
COG2RIS1_G2RIS14_POSN                    equ 0006h
COG2RIS1_G2RIS14_POSITION                equ 0006h
COG2RIS1_G2RIS14_SIZE                    equ 0001h
COG2RIS1_G2RIS14_LENGTH                  equ 0001h
COG2RIS1_G2RIS14_MASK                    equ 0040h
COG2RIS1_G2RIS15_POSN                    equ 0007h
COG2RIS1_G2RIS15_POSITION                equ 0007h
COG2RIS1_G2RIS15_SIZE                    equ 0001h
COG2RIS1_G2RIS15_LENGTH                  equ 0001h
COG2RIS1_G2RIS15_MASK                    equ 0080h

// Register: COG2RSIM0
#define COG2RSIM0 COG2RSIM0
COG2RSIM0                                equ 0717h
// bitfield definitions
COG2RSIM0_RSIM0_POSN                     equ 0000h
COG2RSIM0_RSIM0_POSITION                 equ 0000h
COG2RSIM0_RSIM0_SIZE                     equ 0001h
COG2RSIM0_RSIM0_LENGTH                   equ 0001h
COG2RSIM0_RSIM0_MASK                     equ 0001h
COG2RSIM0_RSIM1_POSN                     equ 0001h
COG2RSIM0_RSIM1_POSITION                 equ 0001h
COG2RSIM0_RSIM1_SIZE                     equ 0001h
COG2RSIM0_RSIM1_LENGTH                   equ 0001h
COG2RSIM0_RSIM1_MASK                     equ 0002h
COG2RSIM0_RSIM2_POSN                     equ 0002h
COG2RSIM0_RSIM2_POSITION                 equ 0002h
COG2RSIM0_RSIM2_SIZE                     equ 0001h
COG2RSIM0_RSIM2_LENGTH                   equ 0001h
COG2RSIM0_RSIM2_MASK                     equ 0004h
COG2RSIM0_RSIM3_POSN                     equ 0003h
COG2RSIM0_RSIM3_POSITION                 equ 0003h
COG2RSIM0_RSIM3_SIZE                     equ 0001h
COG2RSIM0_RSIM3_LENGTH                   equ 0001h
COG2RSIM0_RSIM3_MASK                     equ 0008h
COG2RSIM0_RSIM4_POSN                     equ 0004h
COG2RSIM0_RSIM4_POSITION                 equ 0004h
COG2RSIM0_RSIM4_SIZE                     equ 0001h
COG2RSIM0_RSIM4_LENGTH                   equ 0001h
COG2RSIM0_RSIM4_MASK                     equ 0010h
COG2RSIM0_RSIM5_POSN                     equ 0005h
COG2RSIM0_RSIM5_POSITION                 equ 0005h
COG2RSIM0_RSIM5_SIZE                     equ 0001h
COG2RSIM0_RSIM5_LENGTH                   equ 0001h
COG2RSIM0_RSIM5_MASK                     equ 0020h
COG2RSIM0_RSIM6_POSN                     equ 0006h
COG2RSIM0_RSIM6_POSITION                 equ 0006h
COG2RSIM0_RSIM6_SIZE                     equ 0001h
COG2RSIM0_RSIM6_LENGTH                   equ 0001h
COG2RSIM0_RSIM6_MASK                     equ 0040h
COG2RSIM0_RSIM7_POSN                     equ 0007h
COG2RSIM0_RSIM7_POSITION                 equ 0007h
COG2RSIM0_RSIM7_SIZE                     equ 0001h
COG2RSIM0_RSIM7_LENGTH                   equ 0001h
COG2RSIM0_RSIM7_MASK                     equ 0080h
COG2RSIM0_G2RSIM0_POSN                   equ 0000h
COG2RSIM0_G2RSIM0_POSITION               equ 0000h
COG2RSIM0_G2RSIM0_SIZE                   equ 0001h
COG2RSIM0_G2RSIM0_LENGTH                 equ 0001h
COG2RSIM0_G2RSIM0_MASK                   equ 0001h
COG2RSIM0_G2RSIM1_POSN                   equ 0001h
COG2RSIM0_G2RSIM1_POSITION               equ 0001h
COG2RSIM0_G2RSIM1_SIZE                   equ 0001h
COG2RSIM0_G2RSIM1_LENGTH                 equ 0001h
COG2RSIM0_G2RSIM1_MASK                   equ 0002h
COG2RSIM0_G2RSIM2_POSN                   equ 0002h
COG2RSIM0_G2RSIM2_POSITION               equ 0002h
COG2RSIM0_G2RSIM2_SIZE                   equ 0001h
COG2RSIM0_G2RSIM2_LENGTH                 equ 0001h
COG2RSIM0_G2RSIM2_MASK                   equ 0004h
COG2RSIM0_G2RSIM3_POSN                   equ 0003h
COG2RSIM0_G2RSIM3_POSITION               equ 0003h
COG2RSIM0_G2RSIM3_SIZE                   equ 0001h
COG2RSIM0_G2RSIM3_LENGTH                 equ 0001h
COG2RSIM0_G2RSIM3_MASK                   equ 0008h
COG2RSIM0_G2RSIM4_POSN                   equ 0004h
COG2RSIM0_G2RSIM4_POSITION               equ 0004h
COG2RSIM0_G2RSIM4_SIZE                   equ 0001h
COG2RSIM0_G2RSIM4_LENGTH                 equ 0001h
COG2RSIM0_G2RSIM4_MASK                   equ 0010h
COG2RSIM0_G2RSIM5_POSN                   equ 0005h
COG2RSIM0_G2RSIM5_POSITION               equ 0005h
COG2RSIM0_G2RSIM5_SIZE                   equ 0001h
COG2RSIM0_G2RSIM5_LENGTH                 equ 0001h
COG2RSIM0_G2RSIM5_MASK                   equ 0020h
COG2RSIM0_G2RSIM6_POSN                   equ 0006h
COG2RSIM0_G2RSIM6_POSITION               equ 0006h
COG2RSIM0_G2RSIM6_SIZE                   equ 0001h
COG2RSIM0_G2RSIM6_LENGTH                 equ 0001h
COG2RSIM0_G2RSIM6_MASK                   equ 0040h
COG2RSIM0_G2RSIM7_POSN                   equ 0007h
COG2RSIM0_G2RSIM7_POSITION               equ 0007h
COG2RSIM0_G2RSIM7_SIZE                   equ 0001h
COG2RSIM0_G2RSIM7_LENGTH                 equ 0001h
COG2RSIM0_G2RSIM7_MASK                   equ 0080h

// Register: COG2RSIM1
#define COG2RSIM1 COG2RSIM1
COG2RSIM1                                equ 0718h
// bitfield definitions
COG2RSIM1_RSIM8_POSN                     equ 0000h
COG2RSIM1_RSIM8_POSITION                 equ 0000h
COG2RSIM1_RSIM8_SIZE                     equ 0001h
COG2RSIM1_RSIM8_LENGTH                   equ 0001h
COG2RSIM1_RSIM8_MASK                     equ 0001h
COG2RSIM1_RSIM9_POSN                     equ 0001h
COG2RSIM1_RSIM9_POSITION                 equ 0001h
COG2RSIM1_RSIM9_SIZE                     equ 0001h
COG2RSIM1_RSIM9_LENGTH                   equ 0001h
COG2RSIM1_RSIM9_MASK                     equ 0002h
COG2RSIM1_RSIM10_POSN                    equ 0002h
COG2RSIM1_RSIM10_POSITION                equ 0002h
COG2RSIM1_RSIM10_SIZE                    equ 0001h
COG2RSIM1_RSIM10_LENGTH                  equ 0001h
COG2RSIM1_RSIM10_MASK                    equ 0004h
COG2RSIM1_RSIM11_POSN                    equ 0003h
COG2RSIM1_RSIM11_POSITION                equ 0003h
COG2RSIM1_RSIM11_SIZE                    equ 0001h
COG2RSIM1_RSIM11_LENGTH                  equ 0001h
COG2RSIM1_RSIM11_MASK                    equ 0008h
COG2RSIM1_RSIM12_POSN                    equ 0004h
COG2RSIM1_RSIM12_POSITION                equ 0004h
COG2RSIM1_RSIM12_SIZE                    equ 0001h
COG2RSIM1_RSIM12_LENGTH                  equ 0001h
COG2RSIM1_RSIM12_MASK                    equ 0010h
COG2RSIM1_RSIM13_POSN                    equ 0005h
COG2RSIM1_RSIM13_POSITION                equ 0005h
COG2RSIM1_RSIM13_SIZE                    equ 0001h
COG2RSIM1_RSIM13_LENGTH                  equ 0001h
COG2RSIM1_RSIM13_MASK                    equ 0020h
COG2RSIM1_RSIM14_POSN                    equ 0006h
COG2RSIM1_RSIM14_POSITION                equ 0006h
COG2RSIM1_RSIM14_SIZE                    equ 0001h
COG2RSIM1_RSIM14_LENGTH                  equ 0001h
COG2RSIM1_RSIM14_MASK                    equ 0040h
COG2RSIM1_RSIM15_POSN                    equ 0007h
COG2RSIM1_RSIM15_POSITION                equ 0007h
COG2RSIM1_RSIM15_SIZE                    equ 0001h
COG2RSIM1_RSIM15_LENGTH                  equ 0001h
COG2RSIM1_RSIM15_MASK                    equ 0080h
COG2RSIM1_G2RSIM8_POSN                   equ 0000h
COG2RSIM1_G2RSIM8_POSITION               equ 0000h
COG2RSIM1_G2RSIM8_SIZE                   equ 0001h
COG2RSIM1_G2RSIM8_LENGTH                 equ 0001h
COG2RSIM1_G2RSIM8_MASK                   equ 0001h
COG2RSIM1_G2RSIM9_POSN                   equ 0001h
COG2RSIM1_G2RSIM9_POSITION               equ 0001h
COG2RSIM1_G2RSIM9_SIZE                   equ 0001h
COG2RSIM1_G2RSIM9_LENGTH                 equ 0001h
COG2RSIM1_G2RSIM9_MASK                   equ 0002h
COG2RSIM1_G2RSIM10_POSN                  equ 0002h
COG2RSIM1_G2RSIM10_POSITION              equ 0002h
COG2RSIM1_G2RSIM10_SIZE                  equ 0001h
COG2RSIM1_G2RSIM10_LENGTH                equ 0001h
COG2RSIM1_G2RSIM10_MASK                  equ 0004h
COG2RSIM1_G2RSIM11_POSN                  equ 0003h
COG2RSIM1_G2RSIM11_POSITION              equ 0003h
COG2RSIM1_G2RSIM11_SIZE                  equ 0001h
COG2RSIM1_G2RSIM11_LENGTH                equ 0001h
COG2RSIM1_G2RSIM11_MASK                  equ 0008h
COG2RSIM1_G2RSIM12_POSN                  equ 0004h
COG2RSIM1_G2RSIM12_POSITION              equ 0004h
COG2RSIM1_G2RSIM12_SIZE                  equ 0001h
COG2RSIM1_G2RSIM12_LENGTH                equ 0001h
COG2RSIM1_G2RSIM12_MASK                  equ 0010h
COG2RSIM1_G2RSIM13_POSN                  equ 0005h
COG2RSIM1_G2RSIM13_POSITION              equ 0005h
COG2RSIM1_G2RSIM13_SIZE                  equ 0001h
COG2RSIM1_G2RSIM13_LENGTH                equ 0001h
COG2RSIM1_G2RSIM13_MASK                  equ 0020h
COG2RSIM1_G2RSIM14_POSN                  equ 0006h
COG2RSIM1_G2RSIM14_POSITION              equ 0006h
COG2RSIM1_G2RSIM14_SIZE                  equ 0001h
COG2RSIM1_G2RSIM14_LENGTH                equ 0001h
COG2RSIM1_G2RSIM14_MASK                  equ 0040h
COG2RSIM1_G2RSIM15_POSN                  equ 0007h
COG2RSIM1_G2RSIM15_POSITION              equ 0007h
COG2RSIM1_G2RSIM15_SIZE                  equ 0001h
COG2RSIM1_G2RSIM15_LENGTH                equ 0001h
COG2RSIM1_G2RSIM15_MASK                  equ 0080h

