GopalSaraf/Practicals/PSDL/include/proc/pic16f1777.inc
// Register: PRG3CON1
#define PRG3CON1 PRG3CON1
PRG3CON1                                 equ 079Eh
// bitfield definitions
PRG3CON1_RPOL_POSN                       equ 0000h
PRG3CON1_RPOL_POSITION                   equ 0000h
PRG3CON1_RPOL_SIZE                       equ 0001h
PRG3CON1_RPOL_LENGTH                     equ 0001h
PRG3CON1_RPOL_MASK                       equ 0001h
PRG3CON1_FPOL_POSN                       equ 0001h
PRG3CON1_FPOL_POSITION                   equ 0001h
PRG3CON1_FPOL_SIZE                       equ 0001h
PRG3CON1_FPOL_LENGTH                     equ 0001h
PRG3CON1_FPOL_MASK                       equ 0002h
PRG3CON1_RDY_POSN                        equ 0002h
PRG3CON1_RDY_POSITION                    equ 0002h
PRG3CON1_RDY_SIZE                        equ 0001h
PRG3CON1_RDY_LENGTH                      equ 0001h
PRG3CON1_RDY_MASK                        equ 0004h
PRG3CON1_RG3RPOL_POSN                    equ 0000h
PRG3CON1_RG3RPOL_POSITION                equ 0000h
PRG3CON1_RG3RPOL_SIZE                    equ 0001h
PRG3CON1_RG3RPOL_LENGTH                  equ 0001h
PRG3CON1_RG3RPOL_MASK                    equ 0001h
PRG3CON1_RG3FPOL_POSN                    equ 0001h
PRG3CON1_RG3FPOL_POSITION                equ 0001h
PRG3CON1_RG3FPOL_SIZE                    equ 0001h
PRG3CON1_RG3FPOL_LENGTH                  equ 0001h
PRG3CON1_RG3FPOL_MASK                    equ 0002h
PRG3CON1_RG3RDY_POSN                     equ 0002h
PRG3CON1_RG3RDY_POSITION                 equ 0002h
PRG3CON1_RG3RDY_SIZE                     equ 0001h
PRG3CON1_RG3RDY_LENGTH                   equ 0001h
PRG3CON1_RG3RDY_MASK                     equ 0004h

// Register: PRG3CON2
#define PRG3CON2 PRG3CON2
PRG3CON2                                 equ 079Fh
// bitfield definitions
PRG3CON2_ISET_POSN                       equ 0000h
PRG3CON2_ISET_POSITION                   equ 0000h
PRG3CON2_ISET_SIZE                       equ 0005h
PRG3CON2_ISET_LENGTH                     equ 0005h
PRG3CON2_ISET_MASK                       equ 001Fh
PRG3CON2_ISET0_POSN                      equ 0000h
PRG3CON2_ISET0_POSITION                  equ 0000h
PRG3CON2_ISET0_SIZE                      equ 0001h
PRG3CON2_ISET0_LENGTH                    equ 0001h
PRG3CON2_ISET0_MASK                      equ 0001h
PRG3CON2_ISET1_POSN                      equ 0001h
PRG3CON2_ISET1_POSITION                  equ 0001h
PRG3CON2_ISET1_SIZE                      equ 0001h
PRG3CON2_ISET1_LENGTH                    equ 0001h
PRG3CON2_ISET1_MASK                      equ 0002h
PRG3CON2_ISET2_POSN                      equ 0002h
PRG3CON2_ISET2_POSITION                  equ 0002h
PRG3CON2_ISET2_SIZE                      equ 0001h
PRG3CON2_ISET2_LENGTH                    equ 0001h
PRG3CON2_ISET2_MASK                      equ 0004h
PRG3CON2_ISET3_POSN                      equ 0003h
PRG3CON2_ISET3_POSITION                  equ 0003h
PRG3CON2_ISET3_SIZE                      equ 0001h
PRG3CON2_ISET3_LENGTH                    equ 0001h
PRG3CON2_ISET3_MASK                      equ 0008h
PRG3CON2_ISET4_POSN                      equ 0004h
PRG3CON2_ISET4_POSITION                  equ 0004h
PRG3CON2_ISET4_SIZE                      equ 0001h
PRG3CON2_ISET4_LENGTH                    equ 0001h
PRG3CON2_ISET4_MASK                      equ 0010h
PRG3CON2_RG3ISET_POSN                    equ 0000h
PRG3CON2_RG3ISET_POSITION                equ 0000h
PRG3CON2_RG3ISET_SIZE                    equ 0005h
PRG3CON2_RG3ISET_LENGTH                  equ 0005h
PRG3CON2_RG3ISET_MASK                    equ 001Fh
PRG3CON2_RG3ISET0_POSN                   equ 0000h
PRG3CON2_RG3ISET0_POSITION               equ 0000h
PRG3CON2_RG3ISET0_SIZE                   equ 0001h
PRG3CON2_RG3ISET0_LENGTH                 equ 0001h
PRG3CON2_RG3ISET0_MASK                   equ 0001h
PRG3CON2_RG3ISET1_POSN                   equ 0001h
PRG3CON2_RG3ISET1_POSITION               equ 0001h
PRG3CON2_RG3ISET1_SIZE                   equ 0001h
PRG3CON2_RG3ISET1_LENGTH                 equ 0001h
PRG3CON2_RG3ISET1_MASK                   equ 0002h
PRG3CON2_RG3ISET2_POSN                   equ 0002h
PRG3CON2_RG3ISET2_POSITION               equ 0002h
PRG3CON2_RG3ISET2_SIZE                   equ 0001h
PRG3CON2_RG3ISET2_LENGTH                 equ 0001h
PRG3CON2_RG3ISET2_MASK                   equ 0004h
PRG3CON2_RG3ISET3_POSN                   equ 0003h
PRG3CON2_RG3ISET3_POSITION               equ 0003h
PRG3CON2_RG3ISET3_SIZE                   equ 0001h
PRG3CON2_RG3ISET3_LENGTH                 equ 0001h
PRG3CON2_RG3ISET3_MASK                   equ 0008h
PRG3CON2_RG3ISET4_POSN                   equ 0004h
PRG3CON2_RG3ISET4_POSITION               equ 0004h
PRG3CON2_RG3ISET4_SIZE                   equ 0001h
PRG3CON2_RG3ISET4_LENGTH                 equ 0001h
PRG3CON2_RG3ISET4_MASK                   equ 0010h

// Register: COG3PHR
#define COG3PHR COG3PHR
COG3PHR                                  equ 080Dh
// bitfield definitions
COG3PHR_PHR_POSN                         equ 0000h
COG3PHR_PHR_POSITION                     equ 0000h
COG3PHR_PHR_SIZE                         equ 0006h
COG3PHR_PHR_LENGTH                       equ 0006h
COG3PHR_PHR_MASK                         equ 003Fh
COG3PHR_PHR0_POSN                        equ 0000h
COG3PHR_PHR0_POSITION                    equ 0000h
COG3PHR_PHR0_SIZE                        equ 0001h
COG3PHR_PHR0_LENGTH                      equ 0001h
COG3PHR_PHR0_MASK                        equ 0001h
COG3PHR_PHR1_POSN                        equ 0001h
COG3PHR_PHR1_POSITION                    equ 0001h
COG3PHR_PHR1_SIZE                        equ 0001h
COG3PHR_PHR1_LENGTH                      equ 0001h
COG3PHR_PHR1_MASK                        equ 0002h
COG3PHR_PHR2_POSN                        equ 0002h
COG3PHR_PHR2_POSITION                    equ 0002h
COG3PHR_PHR2_SIZE                        equ 0001h
COG3PHR_PHR2_LENGTH                      equ 0001h
COG3PHR_PHR2_MASK                        equ 0004h
COG3PHR_PHR3_POSN                        equ 0003h
COG3PHR_PHR3_POSITION                    equ 0003h
COG3PHR_PHR3_SIZE                        equ 0001h
COG3PHR_PHR3_LENGTH                      equ 0001h
COG3PHR_PHR3_MASK                        equ 0008h
COG3PHR_PHR4_POSN                        equ 0004h
COG3PHR_PHR4_POSITION                    equ 0004h
COG3PHR_PHR4_SIZE                        equ 0001h
COG3PHR_PHR4_LENGTH                      equ 0001h
COG3PHR_PHR4_MASK                        equ 0010h
COG3PHR_PHR5_POSN                        equ 0005h
COG3PHR_PHR5_POSITION                    equ 0005h
COG3PHR_PHR5_SIZE                        equ 0001h
COG3PHR_PHR5_LENGTH                      equ 0001h
COG3PHR_PHR5_MASK                        equ 0020h
COG3PHR_G3PHR0_POSN                      equ 0000h
COG3PHR_G3PHR0_POSITION                  equ 0000h
COG3PHR_G3PHR0_SIZE                      equ 0001h
COG3PHR_G3PHR0_LENGTH                    equ 0001h
COG3PHR_G3PHR0_MASK                      equ 0001h
COG3PHR_G3PHR1_POSN                      equ 0001h
COG3PHR_G3PHR1_POSITION                  equ 0001h
COG3PHR_G3PHR1_SIZE                      equ 0001h
COG3PHR_G3PHR1_LENGTH                    equ 0001h
COG3PHR_G3PHR1_MASK                      equ 0002h
COG3PHR_G3PHR2_POSN                      equ 0002h
COG3PHR_G3PHR2_POSITION                  equ 0002h
COG3PHR_G3PHR2_SIZE                      equ 0001h
COG3PHR_G3PHR2_LENGTH                    equ 0001h
COG3PHR_G3PHR2_MASK                      equ 0004h
COG3PHR_G3PHR3_POSN                      equ 0003h
COG3PHR_G3PHR3_POSITION                  equ 0003h
COG3PHR_G3PHR3_SIZE                      equ 0001h
COG3PHR_G3PHR3_LENGTH                    equ 0001h
COG3PHR_G3PHR3_MASK                      equ 0008h
COG3PHR_G3PHR4_POSN                      equ 0004h
COG3PHR_G3PHR4_POSITION                  equ 0004h
COG3PHR_G3PHR4_SIZE                      equ 0001h
COG3PHR_G3PHR4_LENGTH                    equ 0001h
COG3PHR_G3PHR4_MASK                      equ 0010h
COG3PHR_G3PHR5_POSN                      equ 0005h
COG3PHR_G3PHR5_POSITION                  equ 0005h
COG3PHR_G3PHR5_SIZE                      equ 0001h
COG3PHR_G3PHR5_LENGTH                    equ 0001h
COG3PHR_G3PHR5_MASK                      equ 0020h

// Register: COG3PHF
#define COG3PHF COG3PHF
COG3PHF                                  equ 080Eh
// bitfield definitions
COG3PHF_PHF_POSN                         equ 0000h
COG3PHF_PHF_POSITION                     equ 0000h
COG3PHF_PHF_SIZE                         equ 0006h
COG3PHF_PHF_LENGTH                       equ 0006h
COG3PHF_PHF_MASK                         equ 003Fh
COG3PHF_PHF0_POSN                        equ 0000h
COG3PHF_PHF0_POSITION                    equ 0000h
COG3PHF_PHF0_SIZE                        equ 0001h
COG3PHF_PHF0_LENGTH                      equ 0001h
COG3PHF_PHF0_MASK                        equ 0001h
COG3PHF_PHF1_POSN                        equ 0001h
COG3PHF_PHF1_POSITION                    equ 0001h
COG3PHF_PHF1_SIZE                        equ 0001h
COG3PHF_PHF1_LENGTH                      equ 0001h
COG3PHF_PHF1_MASK                        equ 0002h
COG3PHF_PHF2_POSN                        equ 0002h
COG3PHF_PHF2_POSITION                    equ 0002h
COG3PHF_PHF2_SIZE                        equ 0001h
COG3PHF_PHF2_LENGTH                      equ 0001h
COG3PHF_PHF2_MASK                        equ 0004h
COG3PHF_PHF3_POSN                        equ 0003h
COG3PHF_PHF3_POSITION                    equ 0003h
COG3PHF_PHF3_SIZE                        equ 0001h
COG3PHF_PHF3_LENGTH                      equ 0001h
COG3PHF_PHF3_MASK                        equ 0008h
COG3PHF_PHF4_POSN                        equ 0004h
COG3PHF_PHF4_POSITION                    equ 0004h
COG3PHF_PHF4_SIZE                        equ 0001h
COG3PHF_PHF4_LENGTH                      equ 0001h
COG3PHF_PHF4_MASK                        equ 0010h
COG3PHF_PHF5_POSN                        equ 0005h
COG3PHF_PHF5_POSITION                    equ 0005h
COG3PHF_PHF5_SIZE                        equ 0001h
COG3PHF_PHF5_LENGTH                      equ 0001h
COG3PHF_PHF5_MASK                        equ 0020h
COG3PHF_G3PHF0_POSN                      equ 0000h
COG3PHF_G3PHF0_POSITION                  equ 0000h
COG3PHF_G3PHF0_SIZE                      equ 0001h
COG3PHF_G3PHF0_LENGTH                    equ 0001h
COG3PHF_G3PHF0_MASK                      equ 0001h
COG3PHF_G3PHF1_POSN                      equ 0001h
COG3PHF_G3PHF1_POSITION                  equ 0001h
COG3PHF_G3PHF1_SIZE                      equ 0001h
COG3PHF_G3PHF1_LENGTH                    equ 0001h
COG3PHF_G3PHF1_MASK                      equ 0002h
COG3PHF_G3PHF2_POSN                      equ 0002h
COG3PHF_G3PHF2_POSITION                  equ 0002h
COG3PHF_G3PHF2_SIZE                      equ 0001h
COG3PHF_G3PHF2_LENGTH                    equ 0001h
COG3PHF_G3PHF2_MASK                      equ 0004h
COG3PHF_G3PHF3_POSN                      equ 0003h
COG3PHF_G3PHF3_POSITION                  equ 0003h
COG3PHF_G3PHF3_SIZE                      equ 0001h
COG3PHF_G3PHF3_LENGTH                    equ 0001h
COG3PHF_G3PHF3_MASK                      equ 0008h
COG3PHF_G3PHF4_POSN                      equ 0004h
COG3PHF_G3PHF4_POSITION                  equ 0004h
COG3PHF_G3PHF4_SIZE                      equ 0001h
COG3PHF_G3PHF4_LENGTH                    equ 0001h
COG3PHF_G3PHF4_MASK                      equ 0010h
COG3PHF_G3PHF5_POSN                      equ 0005h
COG3PHF_G3PHF5_POSITION                  equ 0005h
COG3PHF_G3PHF5_SIZE                      equ 0001h
COG3PHF_G3PHF5_LENGTH                    equ 0001h
COG3PHF_G3PHF5_MASK                      equ 0020h

