GopalSaraf/Practicals/PSDL/include/proc/pic16f1777.inc
// Register: CM7CON1
#define CM7CON1 CM7CON1
CM7CON1                                  equ 0919h
// bitfield definitions
CM7CON1_INTN_POSN                        equ 0000h
CM7CON1_INTN_POSITION                    equ 0000h
CM7CON1_INTN_SIZE                        equ 0001h
CM7CON1_INTN_LENGTH                      equ 0001h
CM7CON1_INTN_MASK                        equ 0001h
CM7CON1_INTP_POSN                        equ 0001h
CM7CON1_INTP_POSITION                    equ 0001h
CM7CON1_INTP_SIZE                        equ 0001h
CM7CON1_INTP_LENGTH                      equ 0001h
CM7CON1_INTP_MASK                        equ 0002h
CM7CON1_C7INTN_POSN                      equ 0000h
CM7CON1_C7INTN_POSITION                  equ 0000h
CM7CON1_C7INTN_SIZE                      equ 0001h
CM7CON1_C7INTN_LENGTH                    equ 0001h
CM7CON1_C7INTN_MASK                      equ 0001h
CM7CON1_C7INTP_POSN                      equ 0001h
CM7CON1_C7INTP_POSITION                  equ 0001h
CM7CON1_C7INTP_SIZE                      equ 0001h
CM7CON1_C7INTP_LENGTH                    equ 0001h
CM7CON1_C7INTP_MASK                      equ 0002h

// Register: CM7NSEL
#define CM7NSEL CM7NSEL
CM7NSEL                                  equ 091Ah
// bitfield definitions
CM7NSEL_NCH_POSN                         equ 0000h
CM7NSEL_NCH_POSITION                     equ 0000h
CM7NSEL_NCH_SIZE                         equ 0004h
CM7NSEL_NCH_LENGTH                       equ 0004h
CM7NSEL_NCH_MASK                         equ 000Fh
CM7NSEL_C7NCH_POSN                       equ 0000h
CM7NSEL_C7NCH_POSITION                   equ 0000h
CM7NSEL_C7NCH_SIZE                       equ 0004h
CM7NSEL_C7NCH_LENGTH                     equ 0004h
CM7NSEL_C7NCH_MASK                       equ 000Fh
CM7NSEL_C7NCH0_POSN                      equ 0000h
CM7NSEL_C7NCH0_POSITION                  equ 0000h
CM7NSEL_C7NCH0_SIZE                      equ 0001h
CM7NSEL_C7NCH0_LENGTH                    equ 0001h
CM7NSEL_C7NCH0_MASK                      equ 0001h
CM7NSEL_C7NCH1_POSN                      equ 0001h
CM7NSEL_C7NCH1_POSITION                  equ 0001h
CM7NSEL_C7NCH1_SIZE                      equ 0001h
CM7NSEL_C7NCH1_LENGTH                    equ 0001h
CM7NSEL_C7NCH1_MASK                      equ 0002h
CM7NSEL_C7NCH2_POSN                      equ 0002h
CM7NSEL_C7NCH2_POSITION                  equ 0002h
CM7NSEL_C7NCH2_SIZE                      equ 0001h
CM7NSEL_C7NCH2_LENGTH                    equ 0001h
CM7NSEL_C7NCH2_MASK                      equ 0004h
CM7NSEL_C7NCH3_POSN                      equ 0003h
CM7NSEL_C7NCH3_POSITION                  equ 0003h
CM7NSEL_C7NCH3_SIZE                      equ 0001h
CM7NSEL_C7NCH3_LENGTH                    equ 0001h
CM7NSEL_C7NCH3_MASK                      equ 0008h

// Register: CM7PSEL
#define CM7PSEL CM7PSEL
CM7PSEL                                  equ 091Bh
// bitfield definitions
CM7PSEL_PCH_POSN                         equ 0000h
CM7PSEL_PCH_POSITION                     equ 0000h
CM7PSEL_PCH_SIZE                         equ 0004h
CM7PSEL_PCH_LENGTH                       equ 0004h
CM7PSEL_PCH_MASK                         equ 000Fh
CM7PSEL_PCH0_POSN                        equ 0000h
CM7PSEL_PCH0_POSITION                    equ 0000h
CM7PSEL_PCH0_SIZE                        equ 0001h
CM7PSEL_PCH0_LENGTH                      equ 0001h
CM7PSEL_PCH0_MASK                        equ 0001h
CM7PSEL_PCH1_POSN                        equ 0001h
CM7PSEL_PCH1_POSITION                    equ 0001h
CM7PSEL_PCH1_SIZE                        equ 0001h
CM7PSEL_PCH1_LENGTH                      equ 0001h
CM7PSEL_PCH1_MASK                        equ 0002h
CM7PSEL_PCH2_POSN                        equ 0002h
CM7PSEL_PCH2_POSITION                    equ 0002h
CM7PSEL_PCH2_SIZE                        equ 0001h
CM7PSEL_PCH2_LENGTH                      equ 0001h
CM7PSEL_PCH2_MASK                        equ 0004h
CM7PSEL_PCH3_POSN                        equ 0003h
CM7PSEL_PCH3_POSITION                    equ 0003h
CM7PSEL_PCH3_SIZE                        equ 0001h
CM7PSEL_PCH3_LENGTH                      equ 0001h
CM7PSEL_PCH3_MASK                        equ 0008h
CM7PSEL_C7PCH_POSN                       equ 0000h
CM7PSEL_C7PCH_POSITION                   equ 0000h
CM7PSEL_C7PCH_SIZE                       equ 0004h
CM7PSEL_C7PCH_LENGTH                     equ 0004h
CM7PSEL_C7PCH_MASK                       equ 000Fh
CM7PSEL_C7PCH0_POSN                      equ 0000h
CM7PSEL_C7PCH0_POSITION                  equ 0000h
CM7PSEL_C7PCH0_SIZE                      equ 0001h
CM7PSEL_C7PCH0_LENGTH                    equ 0001h
CM7PSEL_C7PCH0_MASK                      equ 0001h
CM7PSEL_C7PCH1_POSN                      equ 0001h
CM7PSEL_C7PCH1_POSITION                  equ 0001h
CM7PSEL_C7PCH1_SIZE                      equ 0001h
CM7PSEL_C7PCH1_LENGTH                    equ 0001h
CM7PSEL_C7PCH1_MASK                      equ 0002h
CM7PSEL_C7PCH2_POSN                      equ 0002h
CM7PSEL_C7PCH2_POSITION                  equ 0002h
CM7PSEL_C7PCH2_SIZE                      equ 0001h
CM7PSEL_C7PCH2_LENGTH                    equ 0001h
CM7PSEL_C7PCH2_MASK                      equ 0004h
CM7PSEL_C7PCH3_POSN                      equ 0003h
CM7PSEL_C7PCH3_POSITION                  equ 0003h
CM7PSEL_C7PCH3_SIZE                      equ 0001h
CM7PSEL_C7PCH3_LENGTH                    equ 0001h
CM7PSEL_C7PCH3_MASK                      equ 0008h

// Register: CM8CON0
#define CM8CON0 CM8CON0
CM8CON0                                  equ 091Ch
// bitfield definitions
CM8CON0_SYNC_POSN                        equ 0000h
CM8CON0_SYNC_POSITION                    equ 0000h
CM8CON0_SYNC_SIZE                        equ 0001h
CM8CON0_SYNC_LENGTH                      equ 0001h
CM8CON0_SYNC_MASK                        equ 0001h
CM8CON0_HYS_POSN                         equ 0001h
CM8CON0_HYS_POSITION                     equ 0001h
CM8CON0_HYS_SIZE                         equ 0001h
CM8CON0_HYS_LENGTH                       equ 0001h
CM8CON0_HYS_MASK                         equ 0002h
CM8CON0_ZLF_POSN                         equ 0003h
CM8CON0_ZLF_POSITION                     equ 0003h
CM8CON0_ZLF_SIZE                         equ 0001h
CM8CON0_ZLF_LENGTH                       equ 0001h
CM8CON0_ZLF_MASK                         equ 0008h
CM8CON0_POL_POSN                         equ 0004h
CM8CON0_POL_POSITION                     equ 0004h
CM8CON0_POL_SIZE                         equ 0001h
CM8CON0_POL_LENGTH                       equ 0001h
CM8CON0_POL_MASK                         equ 0010h
CM8CON0_OUT_POSN                         equ 0006h
CM8CON0_OUT_POSITION                     equ 0006h
CM8CON0_OUT_SIZE                         equ 0001h
CM8CON0_OUT_LENGTH                       equ 0001h
CM8CON0_OUT_MASK                         equ 0040h
CM8CON0_ON_POSN                          equ 0007h
CM8CON0_ON_POSITION                      equ 0007h
CM8CON0_ON_SIZE                          equ 0001h
CM8CON0_ON_LENGTH                        equ 0001h
CM8CON0_ON_MASK                          equ 0080h
CM8CON0_C8SYNC_POSN                      equ 0000h
CM8CON0_C8SYNC_POSITION                  equ 0000h
CM8CON0_C8SYNC_SIZE                      equ 0001h
CM8CON0_C8SYNC_LENGTH                    equ 0001h
CM8CON0_C8SYNC_MASK                      equ 0001h
CM8CON0_C8HYS_POSN                       equ 0001h
CM8CON0_C8HYS_POSITION                   equ 0001h
CM8CON0_C8HYS_SIZE                       equ 0001h
CM8CON0_C8HYS_LENGTH                     equ 0001h
CM8CON0_C8HYS_MASK                       equ 0002h
CM8CON0_C8SP_POSN                        equ 0002h
CM8CON0_C8SP_POSITION                    equ 0002h
CM8CON0_C8SP_SIZE                        equ 0001h
CM8CON0_C8SP_LENGTH                      equ 0001h
CM8CON0_C8SP_MASK                        equ 0004h
CM8CON0_C8ZLF_POSN                       equ 0003h
CM8CON0_C8ZLF_POSITION                   equ 0003h
CM8CON0_C8ZLF_SIZE                       equ 0001h
CM8CON0_C8ZLF_LENGTH                     equ 0001h
CM8CON0_C8ZLF_MASK                       equ 0008h
CM8CON0_C8POL_POSN                       equ 0004h
CM8CON0_C8POL_POSITION                   equ 0004h
CM8CON0_C8POL_SIZE                       equ 0001h
CM8CON0_C8POL_LENGTH                     equ 0001h
CM8CON0_C8POL_MASK                       equ 0010h
CM8CON0_C8OUT_POSN                       equ 0006h
CM8CON0_C8OUT_POSITION                   equ 0006h
CM8CON0_C8OUT_SIZE                       equ 0001h
CM8CON0_C8OUT_LENGTH                     equ 0001h
CM8CON0_C8OUT_MASK                       equ 0040h
CM8CON0_C8ON_POSN                        equ 0007h
CM8CON0_C8ON_POSITION                    equ 0007h
CM8CON0_C8ON_SIZE                        equ 0001h
CM8CON0_C8ON_LENGTH                      equ 0001h
CM8CON0_C8ON_MASK                        equ 0080h

