GopalSaraf/Practicals/PSDL/include/proc/pic16f1777.inc
// Register: MD4CON1
#define MD4CON1 MD4CON1
MD4CON1                                  equ 0D1Ch
// bitfield definitions
MD4CON1_CLSYNC_POSN                      equ 0000h
MD4CON1_CLSYNC_POSITION                  equ 0000h
MD4CON1_CLSYNC_SIZE                      equ 0001h
MD4CON1_CLSYNC_LENGTH                    equ 0001h
MD4CON1_CLSYNC_MASK                      equ 0001h
MD4CON1_CLPOL_POSN                       equ 0001h
MD4CON1_CLPOL_POSITION                   equ 0001h
MD4CON1_CLPOL_SIZE                       equ 0001h
MD4CON1_CLPOL_LENGTH                     equ 0001h
MD4CON1_CLPOL_MASK                       equ 0002h
MD4CON1_CHSYNC_POSN                      equ 0004h
MD4CON1_CHSYNC_POSITION                  equ 0004h
MD4CON1_CHSYNC_SIZE                      equ 0001h
MD4CON1_CHSYNC_LENGTH                    equ 0001h
MD4CON1_CHSYNC_MASK                      equ 0010h
MD4CON1_CHPOL_POSN                       equ 0005h
MD4CON1_CHPOL_POSITION                   equ 0005h
MD4CON1_CHPOL_SIZE                       equ 0001h
MD4CON1_CHPOL_LENGTH                     equ 0001h
MD4CON1_CHPOL_MASK                       equ 0020h
MD4CON1_MD4CLSYNC_POSN                   equ 0000h
MD4CON1_MD4CLSYNC_POSITION               equ 0000h
MD4CON1_MD4CLSYNC_SIZE                   equ 0001h
MD4CON1_MD4CLSYNC_LENGTH                 equ 0001h
MD4CON1_MD4CLSYNC_MASK                   equ 0001h
MD4CON1_MD4CLPOL_POSN                    equ 0001h
MD4CON1_MD4CLPOL_POSITION                equ 0001h
MD4CON1_MD4CLPOL_SIZE                    equ 0001h
MD4CON1_MD4CLPOL_LENGTH                  equ 0001h
MD4CON1_MD4CLPOL_MASK                    equ 0002h
MD4CON1_MD4CHSYNC_POSN                   equ 0004h
MD4CON1_MD4CHSYNC_POSITION               equ 0004h
MD4CON1_MD4CHSYNC_SIZE                   equ 0001h
MD4CON1_MD4CHSYNC_LENGTH                 equ 0001h
MD4CON1_MD4CHSYNC_MASK                   equ 0010h
MD4CON1_MD4CHPOL_POSN                    equ 0005h
MD4CON1_MD4CHPOL_POSITION                equ 0005h
MD4CON1_MD4CHPOL_SIZE                    equ 0001h
MD4CON1_MD4CHPOL_LENGTH                  equ 0001h
MD4CON1_MD4CHPOL_MASK                    equ 0020h

// Register: MD4SRC
#define MD4SRC MD4SRC
MD4SRC                                   equ 0D1Dh
// bitfield definitions
MD4SRC_MS_POSN                           equ 0000h
MD4SRC_MS_POSITION                       equ 0000h
MD4SRC_MS_SIZE                           equ 0005h
MD4SRC_MS_LENGTH                         equ 0005h
MD4SRC_MS_MASK                           equ 001Fh
MD4SRC_MS0_POSN                          equ 0000h
MD4SRC_MS0_POSITION                      equ 0000h
MD4SRC_MS0_SIZE                          equ 0001h
MD4SRC_MS0_LENGTH                        equ 0001h
MD4SRC_MS0_MASK                          equ 0001h
MD4SRC_MS1_POSN                          equ 0001h
MD4SRC_MS1_POSITION                      equ 0001h
MD4SRC_MS1_SIZE                          equ 0001h
MD4SRC_MS1_LENGTH                        equ 0001h
MD4SRC_MS1_MASK                          equ 0002h
MD4SRC_MS2_POSN                          equ 0002h
MD4SRC_MS2_POSITION                      equ 0002h
MD4SRC_MS2_SIZE                          equ 0001h
MD4SRC_MS2_LENGTH                        equ 0001h
MD4SRC_MS2_MASK                          equ 0004h
MD4SRC_MS3_POSN                          equ 0003h
MD4SRC_MS3_POSITION                      equ 0003h
MD4SRC_MS3_SIZE                          equ 0001h
MD4SRC_MS3_LENGTH                        equ 0001h
MD4SRC_MS3_MASK                          equ 0008h
MD4SRC_MS4_POSN                          equ 0004h
MD4SRC_MS4_POSITION                      equ 0004h
MD4SRC_MS4_SIZE                          equ 0001h
MD4SRC_MS4_LENGTH                        equ 0001h
MD4SRC_MS4_MASK                          equ 0010h
MD4SRC_MD4MS_POSN                        equ 0000h
MD4SRC_MD4MS_POSITION                    equ 0000h
MD4SRC_MD4MS_SIZE                        equ 0005h
MD4SRC_MD4MS_LENGTH                      equ 0005h
MD4SRC_MD4MS_MASK                        equ 001Fh
MD4SRC_MD4MS0_POSN                       equ 0000h
MD4SRC_MD4MS0_POSITION                   equ 0000h
MD4SRC_MD4MS0_SIZE                       equ 0001h
MD4SRC_MD4MS0_LENGTH                     equ 0001h
MD4SRC_MD4MS0_MASK                       equ 0001h
MD4SRC_MD4MS1_POSN                       equ 0001h
MD4SRC_MD4MS1_POSITION                   equ 0001h
MD4SRC_MD4MS1_SIZE                       equ 0001h
MD4SRC_MD4MS1_LENGTH                     equ 0001h
MD4SRC_MD4MS1_MASK                       equ 0002h
MD4SRC_MD4MS2_POSN                       equ 0002h
MD4SRC_MD4MS2_POSITION                   equ 0002h
MD4SRC_MD4MS2_SIZE                       equ 0001h
MD4SRC_MD4MS2_LENGTH                     equ 0001h
MD4SRC_MD4MS2_MASK                       equ 0004h
MD4SRC_MD4MS3_POSN                       equ 0003h
MD4SRC_MD4MS3_POSITION                   equ 0003h
MD4SRC_MD4MS3_SIZE                       equ 0001h
MD4SRC_MD4MS3_LENGTH                     equ 0001h
MD4SRC_MD4MS3_MASK                       equ 0008h
MD4SRC_MD4MS4_POSN                       equ 0004h
MD4SRC_MD4MS4_POSITION                   equ 0004h
MD4SRC_MD4MS4_SIZE                       equ 0001h
MD4SRC_MD4MS4_LENGTH                     equ 0001h
MD4SRC_MD4MS4_MASK                       equ 0010h

// Register: MD4CARL
#define MD4CARL MD4CARL
MD4CARL                                  equ 0D1Eh
// bitfield definitions
MD4CARL_CL_POSN                          equ 0000h
MD4CARL_CL_POSITION                      equ 0000h
MD4CARL_CL_SIZE                          equ 0005h
MD4CARL_CL_LENGTH                        equ 0005h
MD4CARL_CL_MASK                          equ 001Fh
MD4CARL_CL0_POSN                         equ 0000h
MD4CARL_CL0_POSITION                     equ 0000h
MD4CARL_CL0_SIZE                         equ 0001h
MD4CARL_CL0_LENGTH                       equ 0001h
MD4CARL_CL0_MASK                         equ 0001h
MD4CARL_CL1_POSN                         equ 0001h
MD4CARL_CL1_POSITION                     equ 0001h
MD4CARL_CL1_SIZE                         equ 0001h
MD4CARL_CL1_LENGTH                       equ 0001h
MD4CARL_CL1_MASK                         equ 0002h
MD4CARL_CL2_POSN                         equ 0002h
MD4CARL_CL2_POSITION                     equ 0002h
MD4CARL_CL2_SIZE                         equ 0001h
MD4CARL_CL2_LENGTH                       equ 0001h
MD4CARL_CL2_MASK                         equ 0004h
MD4CARL_CL3_POSN                         equ 0003h
MD4CARL_CL3_POSITION                     equ 0003h
MD4CARL_CL3_SIZE                         equ 0001h
MD4CARL_CL3_LENGTH                       equ 0001h
MD4CARL_CL3_MASK                         equ 0008h
MD4CARL_CL4_POSN                         equ 0004h
MD4CARL_CL4_POSITION                     equ 0004h
MD4CARL_CL4_SIZE                         equ 0001h
MD4CARL_CL4_LENGTH                       equ 0001h
MD4CARL_CL4_MASK                         equ 0010h
MD4CARL_MD4CL_POSN                       equ 0000h
MD4CARL_MD4CL_POSITION                   equ 0000h
MD4CARL_MD4CL_SIZE                       equ 0005h
MD4CARL_MD4CL_LENGTH                     equ 0005h
MD4CARL_MD4CL_MASK                       equ 001Fh
MD4CARL_MD4CL0_POSN                      equ 0000h
MD4CARL_MD4CL0_POSITION                  equ 0000h
MD4CARL_MD4CL0_SIZE                      equ 0001h
MD4CARL_MD4CL0_LENGTH                    equ 0001h
MD4CARL_MD4CL0_MASK                      equ 0001h
MD4CARL_MD4CL1_POSN                      equ 0001h
MD4CARL_MD4CL1_POSITION                  equ 0001h
MD4CARL_MD4CL1_SIZE                      equ 0001h
MD4CARL_MD4CL1_LENGTH                    equ 0001h
MD4CARL_MD4CL1_MASK                      equ 0002h
MD4CARL_MD4CL2_POSN                      equ 0002h
MD4CARL_MD4CL2_POSITION                  equ 0002h
MD4CARL_MD4CL2_SIZE                      equ 0001h
MD4CARL_MD4CL2_LENGTH                    equ 0001h
MD4CARL_MD4CL2_MASK                      equ 0004h
MD4CARL_MD4CL3_POSN                      equ 0003h
MD4CARL_MD4CL3_POSITION                  equ 0003h
MD4CARL_MD4CL3_SIZE                      equ 0001h
MD4CARL_MD4CL3_LENGTH                    equ 0001h
MD4CARL_MD4CL3_MASK                      equ 0008h
MD4CARL_MD4CL4_POSN                      equ 0004h
MD4CARL_MD4CL4_POSITION                  equ 0004h
MD4CARL_MD4CL4_SIZE                      equ 0001h
MD4CARL_MD4CL4_LENGTH                    equ 0001h
MD4CARL_MD4CL4_MASK                      equ 0010h

// Register: MD4CARH
#define MD4CARH MD4CARH
MD4CARH                                  equ 0D1Fh
// bitfield definitions
MD4CARH_CH_POSN                          equ 0000h
MD4CARH_CH_POSITION                      equ 0000h
MD4CARH_CH_SIZE                          equ 0005h
MD4CARH_CH_LENGTH                        equ 0005h
MD4CARH_CH_MASK                          equ 001Fh
MD4CARH_CH0_POSN                         equ 0000h
MD4CARH_CH0_POSITION                     equ 0000h
MD4CARH_CH0_SIZE                         equ 0001h
MD4CARH_CH0_LENGTH                       equ 0001h
MD4CARH_CH0_MASK                         equ 0001h
MD4CARH_CH1_POSN                         equ 0001h
MD4CARH_CH1_POSITION                     equ 0001h
MD4CARH_CH1_SIZE                         equ 0001h
MD4CARH_CH1_LENGTH                       equ 0001h
MD4CARH_CH1_MASK                         equ 0002h
MD4CARH_CH2_POSN                         equ 0002h
MD4CARH_CH2_POSITION                     equ 0002h
MD4CARH_CH2_SIZE                         equ 0001h
MD4CARH_CH2_LENGTH                       equ 0001h
MD4CARH_CH2_MASK                         equ 0004h
MD4CARH_CH3_POSN                         equ 0003h
MD4CARH_CH3_POSITION                     equ 0003h
MD4CARH_CH3_SIZE                         equ 0001h
MD4CARH_CH3_LENGTH                       equ 0001h
MD4CARH_CH3_MASK                         equ 0008h
MD4CARH_CH4_POSN                         equ 0004h
MD4CARH_CH4_POSITION                     equ 0004h
MD4CARH_CH4_SIZE                         equ 0001h
MD4CARH_CH4_LENGTH                       equ 0001h
MD4CARH_CH4_MASK                         equ 0010h
MD4CARH_MD4CH_POSN                       equ 0000h
MD4CARH_MD4CH_POSITION                   equ 0000h
MD4CARH_MD4CH_SIZE                       equ 0005h
MD4CARH_MD4CH_LENGTH                     equ 0005h
MD4CARH_MD4CH_MASK                       equ 001Fh
MD4CARH_MD4CH0_POSN                      equ 0000h
MD4CARH_MD4CH0_POSITION                  equ 0000h
MD4CARH_MD4CH0_SIZE                      equ 0001h
MD4CARH_MD4CH0_LENGTH                    equ 0001h
MD4CARH_MD4CH0_MASK                      equ 0001h
MD4CARH_MD4CH1_POSN                      equ 0001h
MD4CARH_MD4CH1_POSITION                  equ 0001h
MD4CARH_MD4CH1_SIZE                      equ 0001h
MD4CARH_MD4CH1_LENGTH                    equ 0001h
MD4CARH_MD4CH1_MASK                      equ 0002h
MD4CARH_MD4CH2_POSN                      equ 0002h
MD4CARH_MD4CH2_POSITION                  equ 0002h
MD4CARH_MD4CH2_SIZE                      equ 0001h
MD4CARH_MD4CH2_LENGTH                    equ 0001h
MD4CARH_MD4CH2_MASK                      equ 0004h
MD4CARH_MD4CH3_POSN                      equ 0003h
MD4CARH_MD4CH3_POSITION                  equ 0003h
MD4CARH_MD4CH3_SIZE                      equ 0001h
MD4CARH_MD4CH3_LENGTH                    equ 0001h
MD4CARH_MD4CH3_MASK                      equ 0008h
MD4CARH_MD4CH4_POSN                      equ 0004h
MD4CARH_MD4CH4_POSITION                  equ 0004h
MD4CARH_MD4CH4_SIZE                      equ 0001h
MD4CARH_MD4CH4_LENGTH                    equ 0001h
MD4CARH_MD4CH4_MASK                      equ 0010h

// Register: PWMEN
#define PWMEN PWMEN
PWMEN                                    equ 0D8Eh
// bitfield definitions
PWMEN_MPWM5EN_POSN                       equ 0000h
PWMEN_MPWM5EN_POSITION                   equ 0000h
PWMEN_MPWM5EN_SIZE                       equ 0001h
PWMEN_MPWM5EN_LENGTH                     equ 0001h
PWMEN_MPWM5EN_MASK                       equ 0001h
PWMEN_MPWM6EN_POSN                       equ 0001h
PWMEN_MPWM6EN_POSITION                   equ 0001h
PWMEN_MPWM6EN_SIZE                       equ 0001h
PWMEN_MPWM6EN_LENGTH                     equ 0001h
PWMEN_MPWM6EN_MASK                       equ 0002h
PWMEN_MPWM11EN_POSN                      equ 0002h
PWMEN_MPWM11EN_POSITION                  equ 0002h
PWMEN_MPWM11EN_SIZE                      equ 0001h
PWMEN_MPWM11EN_LENGTH                    equ 0001h
PWMEN_MPWM11EN_MASK                      equ 0004h
PWMEN_MPWM12EN_POSN                      equ 0003h
PWMEN_MPWM12EN_POSITION                  equ 0003h
PWMEN_MPWM12EN_SIZE                      equ 0001h
PWMEN_MPWM12EN_LENGTH                    equ 0001h
PWMEN_MPWM12EN_MASK                      equ 0008h

