GopalSaraf/Practicals/PSDL/include/proc/pic16f1777.inc
// Register: PWM12LDCON
#define PWM12LDCON PWM12LDCON
PWM12LDCON                               equ 0DCFh
// bitfield definitions
PWM12LDCON_LDS_POSN                      equ 0000h
PWM12LDCON_LDS_POSITION                  equ 0000h
PWM12LDCON_LDS_SIZE                      equ 0002h
PWM12LDCON_LDS_LENGTH                    equ 0002h
PWM12LDCON_LDS_MASK                      equ 0003h
PWM12LDCON_LDT_POSN                      equ 0006h
PWM12LDCON_LDT_POSITION                  equ 0006h
PWM12LDCON_LDT_SIZE                      equ 0001h
PWM12LDCON_LDT_LENGTH                    equ 0001h
PWM12LDCON_LDT_MASK                      equ 0040h
PWM12LDCON_LDA_POSN                      equ 0007h
PWM12LDCON_LDA_POSITION                  equ 0007h
PWM12LDCON_LDA_SIZE                      equ 0001h
PWM12LDCON_LDA_LENGTH                    equ 0001h
PWM12LDCON_LDA_MASK                      equ 0080h
PWM12LDCON_PWM12LDS0_POSN                equ 0000h
PWM12LDCON_PWM12LDS0_POSITION            equ 0000h
PWM12LDCON_PWM12LDS0_SIZE                equ 0001h
PWM12LDCON_PWM12LDS0_LENGTH              equ 0001h
PWM12LDCON_PWM12LDS0_MASK                equ 0001h
PWM12LDCON_PWM12LDS1_POSN                equ 0001h
PWM12LDCON_PWM12LDS1_POSITION            equ 0001h
PWM12LDCON_PWM12LDS1_SIZE                equ 0001h
PWM12LDCON_PWM12LDS1_LENGTH              equ 0001h
PWM12LDCON_PWM12LDS1_MASK                equ 0002h
PWM12LDCON_PWM12LDS_POSN                 equ 0000h
PWM12LDCON_PWM12LDS_POSITION             equ 0000h
PWM12LDCON_PWM12LDS_SIZE                 equ 0002h
PWM12LDCON_PWM12LDS_LENGTH               equ 0002h
PWM12LDCON_PWM12LDS_MASK                 equ 0003h
PWM12LDCON_PWM12LDM_POSN                 equ 0006h
PWM12LDCON_PWM12LDM_POSITION             equ 0006h
PWM12LDCON_PWM12LDM_SIZE                 equ 0001h
PWM12LDCON_PWM12LDM_LENGTH               equ 0001h
PWM12LDCON_PWM12LDM_MASK                 equ 0040h
PWM12LDCON_PWM12LD_POSN                  equ 0007h
PWM12LDCON_PWM12LD_POSITION              equ 0007h
PWM12LDCON_PWM12LD_SIZE                  equ 0001h
PWM12LDCON_PWM12LD_LENGTH                equ 0001h
PWM12LDCON_PWM12LD_MASK                  equ 0080h
PWM12LDCON_LDS0_POSN                     equ 0000h
PWM12LDCON_LDS0_POSITION                 equ 0000h
PWM12LDCON_LDS0_SIZE                     equ 0001h
PWM12LDCON_LDS0_LENGTH                   equ 0001h
PWM12LDCON_LDS0_MASK                     equ 0001h
PWM12LDCON_LDS1_POSN                     equ 0001h
PWM12LDCON_LDS1_POSITION                 equ 0001h
PWM12LDCON_LDS1_SIZE                     equ 0001h
PWM12LDCON_LDS1_LENGTH                   equ 0001h
PWM12LDCON_LDS1_MASK                     equ 0002h

// Register: PWM12OFCON
#define PWM12OFCON PWM12OFCON
PWM12OFCON                               equ 0DD0h
// bitfield definitions
PWM12OFCON_OFS_POSN                      equ 0000h
PWM12OFCON_OFS_POSITION                  equ 0000h
PWM12OFCON_OFS_SIZE                      equ 0002h
PWM12OFCON_OFS_LENGTH                    equ 0002h
PWM12OFCON_OFS_MASK                      equ 0003h
PWM12OFCON_OFO_POSN                      equ 0004h
PWM12OFCON_OFO_POSITION                  equ 0004h
PWM12OFCON_OFO_SIZE                      equ 0001h
PWM12OFCON_OFO_LENGTH                    equ 0001h
PWM12OFCON_OFO_MASK                      equ 0010h
PWM12OFCON_OFM_POSN                      equ 0005h
PWM12OFCON_OFM_POSITION                  equ 0005h
PWM12OFCON_OFM_SIZE                      equ 0002h
PWM12OFCON_OFM_LENGTH                    equ 0002h
PWM12OFCON_OFM_MASK                      equ 0060h
PWM12OFCON_PWM12OFS0_POSN                equ 0000h
PWM12OFCON_PWM12OFS0_POSITION            equ 0000h
PWM12OFCON_PWM12OFS0_SIZE                equ 0001h
PWM12OFCON_PWM12OFS0_LENGTH              equ 0001h
PWM12OFCON_PWM12OFS0_MASK                equ 0001h
PWM12OFCON_PWM12OFS1_POSN                equ 0001h
PWM12OFCON_PWM12OFS1_POSITION            equ 0001h
PWM12OFCON_PWM12OFS1_SIZE                equ 0001h
PWM12OFCON_PWM12OFS1_LENGTH              equ 0001h
PWM12OFCON_PWM12OFS1_MASK                equ 0002h
PWM12OFCON_PWM12OFM0_POSN                equ 0005h
PWM12OFCON_PWM12OFM0_POSITION            equ 0005h
PWM12OFCON_PWM12OFM0_SIZE                equ 0001h
PWM12OFCON_PWM12OFM0_LENGTH              equ 0001h
PWM12OFCON_PWM12OFM0_MASK                equ 0020h
PWM12OFCON_PWM12OFM1_POSN                equ 0006h
PWM12OFCON_PWM12OFM1_POSITION            equ 0006h
PWM12OFCON_PWM12OFM1_SIZE                equ 0001h
PWM12OFCON_PWM12OFM1_LENGTH              equ 0001h
PWM12OFCON_PWM12OFM1_MASK                equ 0040h
PWM12OFCON_PWM12OFS_POSN                 equ 0000h
PWM12OFCON_PWM12OFS_POSITION             equ 0000h
PWM12OFCON_PWM12OFS_SIZE                 equ 0002h
PWM12OFCON_PWM12OFS_LENGTH               equ 0002h
PWM12OFCON_PWM12OFS_MASK                 equ 0003h
PWM12OFCON_PWM12OFMC_POSN                equ 0004h
PWM12OFCON_PWM12OFMC_POSITION            equ 0004h
PWM12OFCON_PWM12OFMC_SIZE                equ 0001h
PWM12OFCON_PWM12OFMC_LENGTH              equ 0001h
PWM12OFCON_PWM12OFMC_MASK                equ 0010h
PWM12OFCON_PWM12OFM_POSN                 equ 0005h
PWM12OFCON_PWM12OFM_POSITION             equ 0005h
PWM12OFCON_PWM12OFM_SIZE                 equ 0002h
PWM12OFCON_PWM12OFM_LENGTH               equ 0002h
PWM12OFCON_PWM12OFM_MASK                 equ 0060h
PWM12OFCON_OFS0_POSN                     equ 0000h
PWM12OFCON_OFS0_POSITION                 equ 0000h
PWM12OFCON_OFS0_SIZE                     equ 0001h
PWM12OFCON_OFS0_LENGTH                   equ 0001h
PWM12OFCON_OFS0_MASK                     equ 0001h
PWM12OFCON_OFS1_POSN                     equ 0001h
PWM12OFCON_OFS1_POSITION                 equ 0001h
PWM12OFCON_OFS1_SIZE                     equ 0001h
PWM12OFCON_OFS1_LENGTH                   equ 0001h
PWM12OFCON_OFS1_MASK                     equ 0002h
PWM12OFCON_OFM0_POSN                     equ 0005h
PWM12OFCON_OFM0_POSITION                 equ 0005h
PWM12OFCON_OFM0_SIZE                     equ 0001h
PWM12OFCON_OFM0_LENGTH                   equ 0001h
PWM12OFCON_OFM0_MASK                     equ 0020h
PWM12OFCON_OFM1_POSN                     equ 0006h
PWM12OFCON_OFM1_POSITION                 equ 0006h
PWM12OFCON_OFM1_SIZE                     equ 0001h
PWM12OFCON_OFM1_LENGTH                   equ 0001h
PWM12OFCON_OFM1_MASK                     equ 0040h

// Register: PPSLOCK
#define PPSLOCK PPSLOCK
PPSLOCK                                  equ 0E0Ch
// bitfield definitions
PPSLOCK_PPSLOCKED_POSN                   equ 0000h
PPSLOCK_PPSLOCKED_POSITION               equ 0000h
PPSLOCK_PPSLOCKED_SIZE                   equ 0001h
PPSLOCK_PPSLOCKED_LENGTH                 equ 0001h
PPSLOCK_PPSLOCKED_MASK                   equ 0001h

// Register: INTPPS
#define INTPPS INTPPS
INTPPS                                   equ 0E0Dh
// bitfield definitions
INTPPS_INTPPS_POSN                       equ 0000h
INTPPS_INTPPS_POSITION                   equ 0000h
INTPPS_INTPPS_SIZE                       equ 0006h
INTPPS_INTPPS_LENGTH                     equ 0006h
INTPPS_INTPPS_MASK                       equ 003Fh

// Register: T0CKIPPS
#define T0CKIPPS T0CKIPPS
T0CKIPPS                                 equ 0E0Eh
// bitfield definitions
T0CKIPPS_T0CKIPPS_POSN                   equ 0000h
T0CKIPPS_T0CKIPPS_POSITION               equ 0000h
T0CKIPPS_T0CKIPPS_SIZE                   equ 0006h
T0CKIPPS_T0CKIPPS_LENGTH                 equ 0006h
T0CKIPPS_T0CKIPPS_MASK                   equ 003Fh

// Register: T1CKIPPS
#define T1CKIPPS T1CKIPPS
T1CKIPPS                                 equ 0E0Fh
// bitfield definitions
T1CKIPPS_T1CKIPPS_POSN                   equ 0000h
T1CKIPPS_T1CKIPPS_POSITION               equ 0000h
T1CKIPPS_T1CKIPPS_SIZE                   equ 0006h
T1CKIPPS_T1CKIPPS_LENGTH                 equ 0006h
T1CKIPPS_T1CKIPPS_MASK                   equ 003Fh

// Register: T1GPPS
#define T1GPPS T1GPPS
T1GPPS                                   equ 0E10h
// bitfield definitions
T1GPPS_T1GPPS_POSN                       equ 0000h
T1GPPS_T1GPPS_POSITION                   equ 0000h
T1GPPS_T1GPPS_SIZE                       equ 0006h
T1GPPS_T1GPPS_LENGTH                     equ 0006h
T1GPPS_T1GPPS_MASK                       equ 003Fh

