GopalSaraf/Practicals/PSDL/include/proc/pic16f1777.inc
// Register: CLC4GLS0
#define CLC4GLS0 CLC4GLS0
CLC4GLS0                                 equ 0F34h
// bitfield definitions
CLC4GLS0_LC4G1D1N_POSN                   equ 0000h
CLC4GLS0_LC4G1D1N_POSITION               equ 0000h
CLC4GLS0_LC4G1D1N_SIZE                   equ 0001h
CLC4GLS0_LC4G1D1N_LENGTH                 equ 0001h
CLC4GLS0_LC4G1D1N_MASK                   equ 0001h
CLC4GLS0_LC4G1D1T_POSN                   equ 0001h
CLC4GLS0_LC4G1D1T_POSITION               equ 0001h
CLC4GLS0_LC4G1D1T_SIZE                   equ 0001h
CLC4GLS0_LC4G1D1T_LENGTH                 equ 0001h
CLC4GLS0_LC4G1D1T_MASK                   equ 0002h
CLC4GLS0_LC4G1D2N_POSN                   equ 0002h
CLC4GLS0_LC4G1D2N_POSITION               equ 0002h
CLC4GLS0_LC4G1D2N_SIZE                   equ 0001h
CLC4GLS0_LC4G1D2N_LENGTH                 equ 0001h
CLC4GLS0_LC4G1D2N_MASK                   equ 0004h
CLC4GLS0_LC4G1D2T_POSN                   equ 0003h
CLC4GLS0_LC4G1D2T_POSITION               equ 0003h
CLC4GLS0_LC4G1D2T_SIZE                   equ 0001h
CLC4GLS0_LC4G1D2T_LENGTH                 equ 0001h
CLC4GLS0_LC4G1D2T_MASK                   equ 0008h
CLC4GLS0_LC4G1D3N_POSN                   equ 0004h
CLC4GLS0_LC4G1D3N_POSITION               equ 0004h
CLC4GLS0_LC4G1D3N_SIZE                   equ 0001h
CLC4GLS0_LC4G1D3N_LENGTH                 equ 0001h
CLC4GLS0_LC4G1D3N_MASK                   equ 0010h
CLC4GLS0_LC4G1D3T_POSN                   equ 0005h
CLC4GLS0_LC4G1D3T_POSITION               equ 0005h
CLC4GLS0_LC4G1D3T_SIZE                   equ 0001h
CLC4GLS0_LC4G1D3T_LENGTH                 equ 0001h
CLC4GLS0_LC4G1D3T_MASK                   equ 0020h
CLC4GLS0_LC4G1D4N_POSN                   equ 0006h
CLC4GLS0_LC4G1D4N_POSITION               equ 0006h
CLC4GLS0_LC4G1D4N_SIZE                   equ 0001h
CLC4GLS0_LC4G1D4N_LENGTH                 equ 0001h
CLC4GLS0_LC4G1D4N_MASK                   equ 0040h
CLC4GLS0_LC4G1D4T_POSN                   equ 0007h
CLC4GLS0_LC4G1D4T_POSITION               equ 0007h
CLC4GLS0_LC4G1D4T_SIZE                   equ 0001h
CLC4GLS0_LC4G1D4T_LENGTH                 equ 0001h
CLC4GLS0_LC4G1D4T_MASK                   equ 0080h
CLC4GLS0_D1N_POSN                        equ 0000h
CLC4GLS0_D1N_POSITION                    equ 0000h
CLC4GLS0_D1N_SIZE                        equ 0001h
CLC4GLS0_D1N_LENGTH                      equ 0001h
CLC4GLS0_D1N_MASK                        equ 0001h
CLC4GLS0_D1T_POSN                        equ 0001h
CLC4GLS0_D1T_POSITION                    equ 0001h
CLC4GLS0_D1T_SIZE                        equ 0001h
CLC4GLS0_D1T_LENGTH                      equ 0001h
CLC4GLS0_D1T_MASK                        equ 0002h
CLC4GLS0_D2N_POSN                        equ 0002h
CLC4GLS0_D2N_POSITION                    equ 0002h
CLC4GLS0_D2N_SIZE                        equ 0001h
CLC4GLS0_D2N_LENGTH                      equ 0001h
CLC4GLS0_D2N_MASK                        equ 0004h
CLC4GLS0_D2T_POSN                        equ 0003h
CLC4GLS0_D2T_POSITION                    equ 0003h
CLC4GLS0_D2T_SIZE                        equ 0001h
CLC4GLS0_D2T_LENGTH                      equ 0001h
CLC4GLS0_D2T_MASK                        equ 0008h
CLC4GLS0_D3N_POSN                        equ 0004h
CLC4GLS0_D3N_POSITION                    equ 0004h
CLC4GLS0_D3N_SIZE                        equ 0001h
CLC4GLS0_D3N_LENGTH                      equ 0001h
CLC4GLS0_D3N_MASK                        equ 0010h
CLC4GLS0_D3T_POSN                        equ 0005h
CLC4GLS0_D3T_POSITION                    equ 0005h
CLC4GLS0_D3T_SIZE                        equ 0001h
CLC4GLS0_D3T_LENGTH                      equ 0001h
CLC4GLS0_D3T_MASK                        equ 0020h
CLC4GLS0_D4N_POSN                        equ 0006h
CLC4GLS0_D4N_POSITION                    equ 0006h
CLC4GLS0_D4N_SIZE                        equ 0001h
CLC4GLS0_D4N_LENGTH                      equ 0001h
CLC4GLS0_D4N_MASK                        equ 0040h
CLC4GLS0_D4T_POSN                        equ 0007h
CLC4GLS0_D4T_POSITION                    equ 0007h
CLC4GLS0_D4T_SIZE                        equ 0001h
CLC4GLS0_D4T_LENGTH                      equ 0001h
CLC4GLS0_D4T_MASK                        equ 0080h

// Register: CLC4GLS1
#define CLC4GLS1 CLC4GLS1
CLC4GLS1                                 equ 0F35h
// bitfield definitions
CLC4GLS1_LC4G2D1N_POSN                   equ 0000h
CLC4GLS1_LC4G2D1N_POSITION               equ 0000h
CLC4GLS1_LC4G2D1N_SIZE                   equ 0001h
CLC4GLS1_LC4G2D1N_LENGTH                 equ 0001h
CLC4GLS1_LC4G2D1N_MASK                   equ 0001h
CLC4GLS1_LC4G2D1T_POSN                   equ 0001h
CLC4GLS1_LC4G2D1T_POSITION               equ 0001h
CLC4GLS1_LC4G2D1T_SIZE                   equ 0001h
CLC4GLS1_LC4G2D1T_LENGTH                 equ 0001h
CLC4GLS1_LC4G2D1T_MASK                   equ 0002h
CLC4GLS1_LC4G2D2N_POSN                   equ 0002h
CLC4GLS1_LC4G2D2N_POSITION               equ 0002h
CLC4GLS1_LC4G2D2N_SIZE                   equ 0001h
CLC4GLS1_LC4G2D2N_LENGTH                 equ 0001h
CLC4GLS1_LC4G2D2N_MASK                   equ 0004h
CLC4GLS1_LC4G2D2T_POSN                   equ 0003h
CLC4GLS1_LC4G2D2T_POSITION               equ 0003h
CLC4GLS1_LC4G2D2T_SIZE                   equ 0001h
CLC4GLS1_LC4G2D2T_LENGTH                 equ 0001h
CLC4GLS1_LC4G2D2T_MASK                   equ 0008h
CLC4GLS1_LC4G2D3N_POSN                   equ 0004h
CLC4GLS1_LC4G2D3N_POSITION               equ 0004h
CLC4GLS1_LC4G2D3N_SIZE                   equ 0001h
CLC4GLS1_LC4G2D3N_LENGTH                 equ 0001h
CLC4GLS1_LC4G2D3N_MASK                   equ 0010h
CLC4GLS1_LC4G2D3T_POSN                   equ 0005h
CLC4GLS1_LC4G2D3T_POSITION               equ 0005h
CLC4GLS1_LC4G2D3T_SIZE                   equ 0001h
CLC4GLS1_LC4G2D3T_LENGTH                 equ 0001h
CLC4GLS1_LC4G2D3T_MASK                   equ 0020h
CLC4GLS1_LC4G2D4N_POSN                   equ 0006h
CLC4GLS1_LC4G2D4N_POSITION               equ 0006h
CLC4GLS1_LC4G2D4N_SIZE                   equ 0001h
CLC4GLS1_LC4G2D4N_LENGTH                 equ 0001h
CLC4GLS1_LC4G2D4N_MASK                   equ 0040h
CLC4GLS1_LC4G2D4T_POSN                   equ 0007h
CLC4GLS1_LC4G2D4T_POSITION               equ 0007h
CLC4GLS1_LC4G2D4T_SIZE                   equ 0001h
CLC4GLS1_LC4G2D4T_LENGTH                 equ 0001h
CLC4GLS1_LC4G2D4T_MASK                   equ 0080h
CLC4GLS1_D1N_POSN                        equ 0000h
CLC4GLS1_D1N_POSITION                    equ 0000h
CLC4GLS1_D1N_SIZE                        equ 0001h
CLC4GLS1_D1N_LENGTH                      equ 0001h
CLC4GLS1_D1N_MASK                        equ 0001h
CLC4GLS1_D1T_POSN                        equ 0001h
CLC4GLS1_D1T_POSITION                    equ 0001h
CLC4GLS1_D1T_SIZE                        equ 0001h
CLC4GLS1_D1T_LENGTH                      equ 0001h
CLC4GLS1_D1T_MASK                        equ 0002h
CLC4GLS1_D2N_POSN                        equ 0002h
CLC4GLS1_D2N_POSITION                    equ 0002h
CLC4GLS1_D2N_SIZE                        equ 0001h
CLC4GLS1_D2N_LENGTH                      equ 0001h
CLC4GLS1_D2N_MASK                        equ 0004h
CLC4GLS1_D2T_POSN                        equ 0003h
CLC4GLS1_D2T_POSITION                    equ 0003h
CLC4GLS1_D2T_SIZE                        equ 0001h
CLC4GLS1_D2T_LENGTH                      equ 0001h
CLC4GLS1_D2T_MASK                        equ 0008h
CLC4GLS1_D3N_POSN                        equ 0004h
CLC4GLS1_D3N_POSITION                    equ 0004h
CLC4GLS1_D3N_SIZE                        equ 0001h
CLC4GLS1_D3N_LENGTH                      equ 0001h
CLC4GLS1_D3N_MASK                        equ 0010h
CLC4GLS1_D3T_POSN                        equ 0005h
CLC4GLS1_D3T_POSITION                    equ 0005h
CLC4GLS1_D3T_SIZE                        equ 0001h
CLC4GLS1_D3T_LENGTH                      equ 0001h
CLC4GLS1_D3T_MASK                        equ 0020h
CLC4GLS1_D4N_POSN                        equ 0006h
CLC4GLS1_D4N_POSITION                    equ 0006h
CLC4GLS1_D4N_SIZE                        equ 0001h
CLC4GLS1_D4N_LENGTH                      equ 0001h
CLC4GLS1_D4N_MASK                        equ 0040h
CLC4GLS1_D4T_POSN                        equ 0007h
CLC4GLS1_D4T_POSITION                    equ 0007h
CLC4GLS1_D4T_SIZE                        equ 0001h
CLC4GLS1_D4T_LENGTH                      equ 0001h
CLC4GLS1_D4T_MASK                        equ 0080h

